

/*  Программа инициализации послед.порта, его прерывания и буферов для прерывания.  */

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xE0 ;  // 0/0  P0.0 - ШИМ вход
                 // 0/0  P0.1 - ШИМ вход
  PDR0 = 0xC0 ;  // 0/0  P0.2 - ШИМ вход
                 // 0/0  P0.3 - ШИМ вход
                 // 0/0  P0.4 - ШИМ вход
                 // 1/0  P0.5 - не используется.
                 // 1/1  P0.6        - i2c: SDA.
                 // 1/1  P0.7        - i2c: SCL.

  DDR1 = 0x6F ;  // 1/0  P1.0 - не используется.
  PDR1 = 0x3a;   // 1/1  P1.1 - CLK ШИМ выхода(выходной ЕРА)
                 // 1/0  P1.2 - выходной дискретный сигнал.
                 // 1/1  P1.3 - не используется.
                 // 0/1  P1.4 - не используется.
                 // 1/1  P1.5 - не используется.
                 // 1/0  P1.6 - USEL.
                 // 0/0  P1.7 - ОСТАНОВ.

DDR2 = 0x0F;     // 1/0  P2.0  - дискретный выход
PDR2 = 0;        // 1/0  P2.1  - дискретный выход
                 // 1/0  P2.2  - дискретный выход
                 // 1/0  P2.3  - дискретный выход
                 // 0/0  P2.4  -вход внешнего прерывания
                 // 0/0  P2.5  -вход внешнего прерывания
                 // 0/0  P2.6  -вход внешнего прерывания
                 // 0/0  P2.7 - вход внешнего прерывания


  DDR3 = 0xB8;   // 0/0  P3.0 - контроль 2Р24
  PDR3 = 0x10;   // 0/0  P3.1 - вход термодатчика
                 // 0/0  P3.2 - контроль Р9
                 // 1/0  P3.3 - не используется.
                 // 1/1  P3.4 - UART0: TX0.
                 // 1/0  P3.5 - не используется.
                 // 0/0  P3.6 - UART0: RX0.
                 // 1/0  P3.7 - не используется.

  DDR4 = 0xff;   // 1/0  P4.0...P4.7 - не используется.
  PDR4 = 0;



  DDR5 = 0xFF;   // 1/0 P5.0-P5.5Порт PPG - изначально как выходы, а затем кому что надо.
  PDR5 = 0x00;   // 1/0 P5.6 - P5.7 - не используются

  DDR6 = 0xE0;   // 0/0 P6.0 - P6.4 - Аналоговые входы АЦП.
                 // 1/0 P6.5 - P6.7 - не используются

  DDR7 = 0xFF;   //  не используется

  DDR8 = 0xff;   // не используется

  DDR9 = 0x01;   // 1/1  P9.0        - CAN0: TXC0.
  PDR9 = 0x03;   // 0/1  P9.1        - CAN0: RXC0.
                 // 0/0  P9.2        -  дискретный вход
                 // 0/0  P9.3        -  дискретный вход
                 // 0/0  Р9.4        -  дискретный вход
                 // 0/0  P9.5        -  дискретный вход

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

