

//  ѕрограмма инициализации послед.порта, его прерывани€ и буферов дл€ прерывани€.

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   ¬ "DDRx": 1 - выход, 0 - вход.
    //   ¬ "PDRx": начальное значение выходного сигнала - 1 или 0.

  DDR0 = 0xFC ;
  PDR0 = 0xff;
  DDR1 = 0x7E ;
  PDR1 = 0x4e;
  DDR2 =0xFF ;
  PDR2 = 0;
  DDR3 =0xFB ;
  PDR3 |=0xC0;//i2c :p36-SCL, p37-SDA
  DDR4 = 0x06 ;  // enable SOT1 (00000110)
  PDR4_P41 = 1;

  DDR5 = 0x00 ;  // ј÷ѕ входы - дл€ начала, как дискретные входы
  DDR6 =0x08 ;

  return   ;
}
/*ƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒ-  */

