/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-*/

/*   Макрос для команды нормализации четырехбайтного операнда.
 *   Параметры:
 *      src   -  источник - четырехбайтный, задается регистровым типом адресации;
 *      dest  -  приемник - однобайтный, задается регистровым типом адресации.
 */
#define   asm_norml( src , dest )     \
                 { \
                   for (dest = 0; (slw)src >=  0; ++ dest) \
                   {\
                     src<<=1;\
                     if ( dest > 31) \
                     {\
                       break;\
                     }\
                   }\
                 }
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-*/
