

//     ПРОГРАММА ЗАПУСКА АЦП НА ИЗМЕРЕНИЕ.
//     Т.к. время преобразования АЦП всего 6мксек то прерывания
//  по готовности АЦП и организация очереди при наложении измерений
//  не предусматриваются.
//--------------------------------------------------------

  //  Программа инициализации АЦП без его прерывания и буферов для прерывания.

void  Start_AD ( void )
  {
//    OutAdBuffCount = 0 ;
//    InAdBuffCount  = 1 ;
//    Flg.NoAdBuffInfo  = 1 ;
     //Настройка портов H и G как аналоговых входов
    PFRG = 0xff;
    PFRH = 0xff;
    ADBL_DBL = 0; // Включаем АЦП

 /* ADMD_MOD1 = 0
    ADMD_MOD0 = 0
    ADMD_STS1 = 0
    ADMD_STS0 = 0
    Одиночное преобразование, програмный запуск
  */

    ADMD = 0;
    ADCH = 0; // Начальный канал AN0
    ADCS = 0; // Очищаем контрольный регистр


    return ;
 }

/*   Функция для запуска измерения - использует внутри себя аналогичный
 * макрос - из-за чего ремя ее выполнения больше, чем макроса, но затраты
 * памяти при ее использовании меньше ( экономится 105 байт на один вызов ).
 *   Ее имеет смысл использовать в программах не требовательных ко времени.
 */
void  AD_Izm( struct Channel_AD ach , word* AddrResult )
{
   mAD_Izm( ach , AddrResult ) ;
    return ;
}
