
void  Init_CPU_Ports ( void )
{
  __set_il(31); //qwer  // set global int-level

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PFRx": 1 - функц. 0 - общего назначен.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

//--------------   Порт 0   --------------------
  // D07-D00 может использоваться как GPIO
  // D00 - выход на разъеме X6 для усреднителей токов Id1, Id2
  // D01 - сброс контроллера Profibus
  // D07-D02 - не используются
  PFR0 = 0xFF; // 1111 1111
  DDR0 = 0xFF; // 1111 1111
  PDR0 = 0x02; // 0000 0010
//----------------------------------------------

//--------------   Порт 1   --------------------
  // D15-D08 может использоваться как GPIO
  // Не используется
//  DDR1 = 0x00; Значения по умолчанию
//  PFR1 = 0x00;
//  PDR1 = 0x00;
//----------------------------------------------

//--------------   Порт 2   --------------------
  // D23-D16 может использоваться как GPIO
  // Не используется
//  DDR2 = 0x00; Значения по умолчанию
//  PFR2 = 0x00;
//  PDR2 = 0x00;
//----------------------------------------------

//--------------   Порт 3   --------------------
  // D31-D24 используется как шина данных для 8-ми разрядной шины
//  DDR3 = 0x00; Значения по умолчанию
//  PFR3 = 0x00;
//  PDR3 = 0x00;
//----------------------------------------------

//--------------   Порт 4   --------------------
  // A07-A00 используется как шина адреса
//  DDR4 = 0x00; Значения по умолчанию
//  PFR4 = 0x00;
//  PDR4 = 0x00;
//----------------------------------------------

//--------------   Порт 5   --------------------
  // A15-A08 используется как шина адреса
//  DDR5 = 0x00; Значения по умолчанию
//  PFR5 = 0x00;
//  PDR5 = 0x00;
//----------------------------------------------

//--------------   Порт 6   --------------------
  // A20-A16 шина адреса, может использоваться как GPIO
  // A18-A16 шина адреса
  // A20-A19 не используется
//  DDR6 = 0x00; // 0000 0000
//  PFR6 = 0xFF; // 1111 1111
//  PDR6 = 0x00;
//----------------------------------------------

//--------------   Порт 27   -------------------
  // Порт 27 - внутренний порт процессора .
  // P277 - вместе с P77 используется как CS7
  PFR27 = 0x80; //необходимо обнулять, иначе порты Р74,Р75,P76 работать не будут
//----------------------------------------------

//--------------   Порт 7   --------------------
  // Дискретные выходы на портах Р74-Р76 (CS6X-CS4X)
  // на "чипе" находятся порты только Р74-Р76
  // Р77 используется как CS7 для CAN
  // P76-P74 - дискретные выходы DO7-DO5
  DDR7 = 0x70; // 0111 0000
  PFR7 = 0x80; // 1000 0000
  PDR7 = 0x00;
//----------------------------------------------

//--------------   Порт 8   --------------------
  // bit 7 - WR3X
  // bit 6 - WR2X
  // bit 5 - WR1X
  // bit 4 - WR0X
  // bit 3 - RDX
  // bit 2 - BRQ
  // bit 1 - BGRNTX
  // bit 0 - RDY
  // P82-P81 дискретные выходы DO4-DO3
  // Остальные как функциональные для внешней шины
  DDR8 = 0x06; // 0000 0110
  PFR8 = 0xF9; // 1111 1001
  PDR8 = 0x00;
//----------------------------------------------

//--------------   Порт 9   --------------------
  // bit 7 - CS3X
  // bit 6 - CS2X
  // bit 5 - CS1X
  // bit 4 - CS0X
  // bit 3 - AH/BOOT
  // bit 2 - CLK
  // bit 1 - ALE
  // bit 0 - AS
  // порты Р91,Р90 используются как дискретные входы/выходы для SIO - DB6,DB5
  // порты P93,P92 - используются как функциональные
  // порты Р95,Р94 - CS1,CS0 не используются
  // порт Р96 используется как CS2 для выбора внешнего RAM
  // порт Р97 используется как CS3 для выбора Profibus
  DDR9 = 0xF3; // C3 1111 0011
  PFR9 = 0xF4; //    1111 0100 - Р91,Р90 - входы
  PDR9 = 0xF0; //    1111 0000
//----------------------------------------------

//--------------   Порт В   --------------------
  // На чипе находятся только PB2-PB0
  // DREQ
  DDRB_DDB0 = 0;
  PFRB_PFB0 = 1;

  // Для ПДФ - FX1
  DDRB_DDB1 = 0;
  PFRB_PFB1 = 0;

  // лампочка USEL
  DDRB_DDB2 = 0;
  PFRB_PFB2 = 0;
//-----------------------------------------------

//--------------   Порт I   ---------------------
  // на "чипе" существует только один бит порта I - PI3
  //Останов
  DDRI_DDI3 = 0;
  PFRI_PFI3 = 0;
//-----------------------------------------------

//--------------   Порт J   ---------------------
  //Дискретные входы
  DDRJ = 0;
  PFRJ = 0;
//-----------------------------------------------

//--------------   Порт K   ---------------------
 //INT0-INT7
  DDRK = 0;
  PFRK = 0xCF;   // 1100 1111
  // INT0 - через джампер J6 - внеш.прерывание, 5-я синхр., DREQ0 (FX0+FX1) ПДФ
  // INT1 - Profibus
  // INT2 - прерывание A1 для ДЗВ
  // INT3 - прерывание К1 для ДЗВ
  // INT4 - прерывание А2 для ДЗВ
  // INT5 - прерывание К2 для ДЗВ или AVAR
  // INT6 - геркон 1В или ITT
  // INT7 - геркон 2В
//-----------------------------------------------

//--------------   Порт L -----------------------
  // PL2-PL0 - EPA компаратор синхронизации 3 канала
  // PL3 - FX0 ПДФ или 4-я синхронизация
  // PL5,PL4 - дискетные выходы Q2,Q1
  // PL7,PL6 - дискетные выходы DO1, DO0
  DDRL = 0xf0;   // 1111 0000
  PFRL = 0x07;   // 0000 0111
  PDRL = 0x30 ;  //
//-----------------------------------------------

//--------------   Порт M   ---------------------
  // PM3,PM2 используются как функциональные - i2c
  // PM1,PM0 используются как выходы выборок SC4,SC3
  // для SIO ( платы S200,S400 )
  DDRM = 0xff;    // 1111 1111
  PFRM = 0x0C;    // 0000 1100
  PDRM_PDM0 = 1 ; // SC3
  PDRM_PDM1 = 1 ; // SC4
//-----------------------------------------------

//--------------   Порт N   ---------------------
  // PN5-PN0 используются для плат SIO ( S200,S400 )
  // Если PN5-PN3 функциональные - то SIO последовательный ( S200,S400 )
  // Если PN5-PN3 общ.назначения - то SIO параллельный ( плата еще не готова )
  DDRN = 0x37; // 0011 0111
               // bit 5 - SCK
               // bit 4 - SСOUT
               // bit 3 - SCIN
//PFRN = 0x00; // 0000 0000 - параллельный
  PFRN = 0x38; // 0011 1000 - последовательный
  PDRN_PDN0 = 1 ; // SC0
  PDRN_PDN1 = 1 ; // SC1
  PDRN_PDN2 = 1 ; // SC2
//-----------------------------------------------

//--------------   Порт О   ---------------------
  // PPG
  DDRO = 0xff;
  PFRO = 0xff;
  // bit 7 - выведен на разъем X6
  // bit 6 - выведен на разъем X6
  // bit 5 - Сумма импульсов возбудителя (FG)
  // bit 4 - DAC2
  // bit 3 - Сумма импульсов Назад2
  // bit 2 - Сумма импульсов Вперед2
  // bit 1 - Сумма импульсов Назад1  (F2)
  // bit 0 - Сумма импульсов Вперед1 (F1)
//-----------------------------------------------

//--------------   Порт Р   ---------------------
  // PP0-PP3 используется под CAN0, CAN1
  // PP5,PP4 могут использоваться как CAN2 или GPIO

#ifdef  _NOT_P5_CAN1    // Если CAN1 не запаян и не подтянут на +5В :
  DDRP = 0x08; // 0000 1000 - RXC1 выход .
  PFRP = 0x07; // 0000 0111 - RXC1 общего назначения .
#else
  DDRP = 0x00;
  PFRP = 0x0F; // 0000 1111
#endif
  PDRP = 0x00;
  /* CAN Port */
  // bit 5 - RXC2 или дискр.вход-выход (X2)
  // bit 4 - TXC2 или дискр.вход-выход (X2)
  // bit 3 - RXC1
  // bit 2 - TXC1
  // bit 1 - RXC0
  // bit 0 - TXC0
//-----------------------------------------------

//--------------   Порт Q   ---------------------
  // используется только UART0 - PQ1,PQ0
  // PQ4 , PQ5 - используются для выборок плат S200,S400
#ifndef  bi_BK1 //bi_BK2
  // PQ2 , PQ3 - используются для выборок плат S200,S400
  DDRQ = 0x3C ;//0011 1100
#else
  // PQ2 , PQ3 - используются для входов bi_BK1 и bi_BK2 порта 2 Pi2 :
  DDRQ = 0x30 ;//0011 0000
#endif
  PFRQ = 0 ;

  PFRQ_PFQ0 = 1;    // Serial Input Pin  - SIN0
  PFRQ_PFQ1 = 1;    // Serial Output Pin - SOT0

  PDRQ_PDQ4 = 1 ; // CS5
  PDRQ_PDQ5 = 1 ; // CS6

  PDRQ_PDQ2 = 1 ; // CS7
  PDRQ_PDQ3 = 1 ; // CS8
  /* UART Port */
  // bit 5 - RX2 или дискр.вход-выход (X2)
  // bit 4 - TX2 или дискр.вход-выход (X2)
  // bit 3 - RX1
  // bit 2 - TX1
  // bit 1 - RX0
  // bit 0 - TX0
//-----------------------------------------------

//--------------   Порт R   ---------------------
  // PR5-PR0 - импульсы якоря
  // PR6 - KF
  // PR7 - контрольная точка KT1
  DDRR = 0x3f; // 0011 1111
  PFRR = 0x00;
  PDRR = 0x3f; // 0011 1111
//-----------------------------------------------

//--------------   Порт S   ---------------------
  // PS5-PS0 - импульсы возбудителя
  // PS6 - KFT
  // PS7 - DB4 в SIO (параллельный)
  DDRS = 0xBF; // 1011 1111
  PFRS = 0x00;
  PDRS = 0x3F; // 0011 1111
//-----------------------------------------------

  return;
}
