
void  Init_CPU_Ports ( void )
{
  __set_il(31); //qwer  // set global int-level

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PFRx": 1 - функц. 0 - общего назначен.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

//--------------   Порт 0   --------------------
  // D07..D00 может использоваться как GPIO
  // D00..D03 - выход DO2-DO5
  // D04      - выход для усреднителей токов Id1, Id2
  // D05      - сброс для сетевой платы
  // D06..D07 - не используются
  PFR0 = 0xFF; // 1111 1111 - все как GPIO
  DDR0 = 0xFF; // 1111 1111 - все как выходы
  PDR0 = 0x00; // 0000 0000
//----------------------------------------------

//--------------   Порт 1   --------------------
//           Не используется
//  D15-D08 может использоваться как GPIO
//  DDR1 = 0x00; Значения по умолчанию
//  PFR1 = 0x00;
//  PDR1 = 0x00;
//----------------------------------------------

//--------------   Порт 2   --------------------
//  D23-D16 используется как шина данных для 16-ти разрядной шины
//  DDR2 = 0x00; Значения по умолчанию
//  PFR2 = 0x00;
//  PDR2 = 0x00;
//----------------------------------------------

//--------------   Порт 3   --------------------
//  D31-D24 используется как шина данных для 16-ти (8-ми) разрядной шины
//  DDR3 = 0x00; Значения по умолчанию
//  PFR3 = 0x00;
//  PDR3 = 0x00;
//----------------------------------------------

//--------------   Порт 4   --------------------
//  A07-A00 используется как шина адреса
//  DDR4 = 0x00; Значения по умолчанию
//  PFR4 = 0x00;
//  PDR4 = 0x00;
//----------------------------------------------

//--------------   Порт 5   --------------------
//   A15-A08 используется как шина адреса
//  DDR5 = 0x00; Значения по умолчанию
//  PFR5 = 0x00;
//  PDR5 = 0x00;
//----------------------------------------------

//--------------   Порт 6   --------------------
// A20-A16 шина адреса, может использоваться как GPIO
// A19..A16 - шина адреса
// A20      - не используется
//  DDR6 = 0x00; // 0000 0000
//  PFR6 = 0xFF; // 1111 1111
//  PDR6 = 0x00;
//----------------------------------------------

//--------------   Порт 27   -------------------
//       внутренний порт процессора .
// P274 - необходим для CS4 (Profibus-Master)
  PFR27 = 0x10;  // 0001 0000
//----------------------------------------------

//--------------   Порт 7   --------------------
// P74 - используется как CS4 для платы (Profibus-Master)
// Р77 - используется как CS7 для CAN
  DDR7 = 0x10; // 0001 0000
  PFR7 = 0x00;
  PDR7 = 0x00;
//----------------------------------------------

//--------------   Порт 8   --------------------
// используется для внешней шины
// P80 - RDY
// P81 - HOLD  нужно для арбитража шины
// P82 - HOLDA нужно для арбитража шины
// P83 - RDX
// P84 - WR0X
// P85 - WR1X
// P86 - WR2X не используется (нужен для процессора)
// P87 - WR3X не используется (нужен для процессора)
  DDR8 = 0x00; // 0000 0000
  PFR8 = 0xF9; // 1111 1001 (HOLD,HOLDA включать в программе если нужно)
//----------------------------------------------

//--------------   Порт 9   --------------------
// Р90 - AS не используется
// P91 - ALE используется для внешней шины
// Р92 - CLK не используется (нужен для процессора)
// Р93 - не используется
// Р94 - CS0 не используется (нужен для процессора)
// Р95 - CS1 не используется
// Р96 - CS2 для выбора внешнего RAM
// Р97 - CS3 для выбора сетевой платы
  DDR9 = 0xF3; //  1111 0011
  PFR9 = 0xF4; //  0101 0100
//PDR9 = 0x40; //  0100 0000
//----------------------------------------------

//--------------   Порт В   --------------------
// PB0 - используется как DREQ для ПДФ
// PB1 - используется для ПДФ.
// PB2 - лампочка USEL

  DDRB_DDB0 = 0;
  PFRB_PFB0 = 1;

  DDRB_DDB1 = 0;
  PFRB_PFB1 = 0;

  DDRB_DDB2 = 1;
  PFRB_PFB2 = 0;
//-----------------------------------------------

//--------------   Порт I   ---------------------
// на "чипе" существует только один бит порта I - PI3
// Останов
  DDRI_DDI3 = 0;
  PFRI_PFI3 = 0;
//-----------------------------------------------

//--------------   Порт J   ---------------------
// PJ7..PJ0 - Дискретные входы
  DDRJ = 0;
  PFRJ = 0;
//-----------------------------------------------

//--------------   Порт K   ---------------------
// PK0 - INT0 используется для ПДФ (FX0+FX1), он же идет на DREQ0
// PK1 - INT1 прерывание от сетевой платы, но для начала GPIO-вход
// PK2 - INT2  ДЗВА1
// PK3 - INT3  ДЗВК1
// PK4 - INT4  ДЗВА2
// PK5 - INT5  ДЗВК2
// PK6 - INT6  Геркон 1В
// PK7 - INT7  Геркон 2В
  DDRK = 0x00;
#ifdef  _NET_IRQ
  PFRK = 0xFF;
#else
  PFRK = 0xFD;
#endif
//-----------------------------------------------

//--------------   Порт L -----------------------
// PL2..PL0 - EPA компаратор синхронизации
// PL3 - ПДФ FX0 или EPA компаратор синхронизации
// PL5..PL4 - дискетные выходы Q2,Q1
// PL7..PL6 - дискетные выходы DO0..DO1
  PDRL = 0x30 ; // 19.04.2010 14:14 - задаём сразу значение порта, до назначения функции, чтоб не проскочил импульс Q1V .
  DDRL = 0xF0;
  PFRL = 0x0F;
  PDRL = 0x30 ;
//-----------------------------------------------

//--------------   Порт M   ---------------------
// PM3..PM2 - используются как функциональные (i2c)
// PM1..PM0 - используются как выходы выборок CS4,CS3 для SIO ( платы S200,S400 )
  DDRM = 0xFF;
  PFRM = 0x0C;
  PDRM_PDM0 = 1 ; // CS3
  PDRM_PDM1 = 1 ; // CS4
//-----------------------------------------------

//--------------   Порт N   ---------------------
// PN5..PN0 используются для плат SIO ( S200,S400 )
// PN0 - CS0
// PN1 - CS1
// PN2 - CS2
// PN3 - SIN3
// PN4 - SOT3
// PN5 - SCK3
  DDRN = 0x37; // 0011 0111
  PFRN = 0x38; // 0011 1000
  PDRN_PDN0 = 1 ; // CS0
  PDRN_PDN1 = 1 ; // CS1
  PDRN_PDN2 = 1 ; // CS2
//-----------------------------------------------

//--------------   Порт О   ---------------------
// PO7..PO0 - PPG
  DDRO = 0xff;
  PDRO |= 0x70;
 // PFRO = 0xff;
//-----------------------------------------------

//--------------   Порт Р   ---------------------
// все используется под 3 CAN
// PP0 - TXC0
// PP1 - RXC0
// PP2 - TXC1
// PP3 - RXC1
// PP4 - TXC2
// PP5 - RXC2

#ifdef  _NOT_P5_CAN2    // Если CAN2 не используется и не подтянут на +5В :
  DDRP = 0x20; // 0010 0000 - RXC2 выход .
  PFRP = 0xDF; // 1101 1111 - RXC2 общего назначения .
#else
  DDRP = 0;
  PFRP = 0xff;
#endif
//-----------------------------------------------

//--------------   Порт Q   ---------------------
// PQ0..PQ1 - используется только UART0
// PQ2..PQ3 - используются для выборок плат S200,S400 или
// PQ4..PQ5 - используются для выборок плат S200,S400
// остальные биты зарезервированы как входы или
// в фунуциональном режиме - UART1, UART2
  DDRQ = 0x3C ;//00111100
  PFRQ = 0 ;

  PFRQ_PFQ0 = 1;    // Serial Input Pin  - SIN0
  PFRQ_PFQ1 = 1;    // Serial Output Pin - SOT0

  PDRQ_PDQ4 = 1 ; // CS5
  PDRQ_PDQ5 = 1 ; // CS6
  PDRQ_PDQ2 = 1 ; // CS7
  PDRQ_PDQ3 = 1 ; // CS8

  /* UART Port */
  // bit 5 - RX2 или дискр.вход-выход (X2)
  // bit 4 - TX2 или дискр.вход-выход (X2)
  // bit 3 - RX1
  // bit 2 - TX1
  // bit 1 - RX0
  // bit 0 - TX0
//-----------------------------------------------

//--------------   Порт R   ---------------------
// импульсы якоря
  DDRR = 0x3F;
  PFRR = 0x00;
  PDRR = 0x3F;
//-----------------------------------------------

//--------------   Порт S   ---------------------
// импульсы тормоза или возбудителя
  DDRS = 0x3F;
  PFRS = 0x00;
  PDRS = 0x3F;
//-----------------------------------------------

  return;
}
