

//       НАБОР ПРИМИТИВОВ ДЛЯ ФОРМИРОВАНИЯ АЛГОРИТМОВ
//  РАБОТЫ НА ЛИНИИ IэC В РЕЖИМЕ МАСТЕРА С ПОДЧИНЕННЫМИ АБОНЕНТАМИ.
//--------------------------------------------------
             /* сброс сигнала SCL. */
#define    mSCL_clr()    PDR0 &= ~0x80
             /*   установка сигнала SCL с ожиданием его установки,
              * если его кто-то притормозил.
              */
#define    mSCL_set()    PDR0 |=  0x80  ;

             /* тестирование линии SDA */
#define    mSDA()      (( PDR0  &  0x40 ) != 0 )
             /* сброс сигнала SDA. */
#define    mSDA_clr()    PDR0 &= ~0x40
             /* установка сигнала SDA. */
#define    mSDA_set()    PDR0 |=  0x40

#define    mSDA_in()    DDR0 &= ~0x40

#define    mSDA_out()   DDR0 |= 0x40

#define    mSCL_SDA_clr()   PDR0 &= ~0xC0  // 06.02.2015 14:59

         /*  Уставка соответствует времени периода 35 мксек.  */
//#define    _T_i2c   0x1u
// 29.10.03 10:43
#define    _T_i2c   9u

             /*   П/п формирования задержки для задания периода
              * сигналов SCL и SDA.
              */
             /*
              *   Применение условной компиляции, чтобы при задании
              * нулевой задержки получить действительно нулевую задержку.
              */
//--------
#ifdef  _T_i2c
#if _T_i2c != 0
//--------

 void Delay( void )
{
  _register word t1 ;

  for ( t1 = timer1 ; (w)(timer1 - t1) < _T_i2c ; ) ;
  return ;
}
//--------
#else
//--------

#define Delay()  ;

//--------
#endif
#endif
//--------


//  Сохранение первоначальной настройки линии i2c.
// Настройка линии i2c под открытый коллектор.
void Set_line_i2c ( void )
{
    // Линия i2c не делится с синхро-портом, по-этому не перестраиваем ее.
//  i2c_buff[0] = DDR0  ;
//  i2c_buff[1] = PDR0  ;

//  DDR0     =  0xff      ;
  return ;
}

//  Востановление первоначальной настройки линии i2c.

void Clr_line_i2c ( void )
{
//  DDR0  = i2c_buff[0]  ;
//  PDR0  = i2c_buff[1]  ;

  return ;
}

