

/*  Программа инициализации послед.порта, его прерывания и буферов для прерывания.  */

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xD0 ;  // 0/0  P0.0 - вход  F00 ПДФ                      ( Elips - P1.0, EPA0 )
                 // 0/0  P0.1 - вход  F90 ПДФ или Сельсин          ( Elips - P1.2, EPA2 )
  PDR0 = 0xC0 ;  // 0/0  P0.2 - вход  оборотный ПДФ или Сельсин    ( Elips - P6.1, EPA9 )
                 // 0/0  P0.3 - входной EPA-сигнал.                ( Elips - P1.1, EPA1 )
                 // 1/0  P0.4 - не используется.
                 // 0/0  P0.5 - входной EPA-сигнал. Синхронизация  ( Elips - P6.0, EPA8 )
                 // 1/1  P0.6        - i2c: SDA.
                 // 1/1  P0.7        - i2c: SCL.

  DDR1 = 0x6F ;  // 1/0  P1.0 - выходной EPA-сигнал.                ( Elips - P1.3, EPA3 )
  PDR1 = 0x3E;   // 1/1  P1.1 - выход сигнала Q2
                 // 1/1  P1.2 - выборка DAC                         ( Elips - P3.0, LDAC )
                 // 1/1  P1.3 - выход сигнала Q1
                 // 0/1  P1.4        - CAN1: RXC1.
                 // 1/1  P1.5        - CAN1: TXC1.
                 // 1/0  P1.6        - USEL.                       ( Elips - P3.1, D1 )
                 // 0/0  P1.7        - ОСТАНОВ.                    ( Elips - P2.7, CLKOUT )
              //P2.0-2.3 выходы выборки микросхем дискретных портов, все 1 т.к. 4 вход дешефратора пустой ( Elips - VB0 - VB3 )

  DDR2 = 0xff ;  // 1/1  P2.0        - CSE0 -  0 разряд выборки для основной платы ВВ       (VB0)
  PDR2 = 0x03;   // 1/1  P2.1        - CSE1 -  1 разряд выборки для основной платы ВВ       (VB1)
                 // 1/0  P2.2        - CSE2 -  выборка чтение/запись для основной платы ВВ  (VB2)
                 // 1/0  P2.3        - CSE3 -  0 разряд выборки для дополнительной платы ВВ (VB3)  0 - т.к. там пустой 0-й вход
                 // 1/0  P2.4        - CSE4 -  1 разряд выборки для дополнительной платы ВВ       (VB4)
                 // 1/0  P2.5        - CSE5 -  выборка чтение/запись для дополнительной платы ВВ  (VB5)
                 // 1/0  P2.6        - CSE6 -  (VB6)
                 // 1/0  P2.7        - CSE7 -  (VB7)


  DDR3 = 0xbf;   // 1/0  P3.0        - выборка АЦП на дешифраторе разряд0 (VC0)
  PDR3 = 0x10;   // 1/0  P3.1        - выборка АЦП на дешифраторе разряд1 (VC1)
                 // 1/0  P3.2        - выборка АЦП на дешифраторе разряд2 (VC2)
                 // 1/0  P3.3        - не используется (VC3)
                 // 1/1  P3.4        - UART0: TX0.
                 // 1/0  P3.5        - выходной дискретный сигнал CS0 , выборка Моста 1 .
                 // 0/0  P3.6        - UART0: RX0.
                 // 1/0  P3.7        - выходной дискретный сигнал CS1 , выборка Моста 2 .

  DDR4 = 0xf0;   // 0/0  P4.0        - Сигнал входа ДЗВ RB1   (VC4)
  PDR4 = 0xd0;   // 0/0  P4.1        - Сигнал входа ДЗВ RB2   (VC5)
                 // 0/0  P4.2        - Сигнал входа ДЗВ RB3   (VC6)
                 // 0/0  P4.3        - Сигнал входа ДЗВ RB4   (VC7)
                 // 1/1  P4.4        - Сигнал включения регистров на выдачу импульсов. (TRIS)
                 // 1/0  P4.5        - не используется
                 // 1/1  P4.6        - SSIO3: CLK. - для DAC
                 // 1/1  P4.7        - SSIO3: OUT. - для DAC
#ifdef _PDF
  DDR5 = 0x3D;   // 0/1  P5.1
  PDR5 = 0x30;
#else
  DDR5 = 0x3F;   // 1/0  P5.0 -
  PDR5 = 0x32;   // 1/0  P5.1 - и.п.'=1' PPG1 для КТЭС - управление импульсными узлами включения V1,V2.
#endif
                 // 1/0  P5.2 -
                 // 1/0  P5.3 -
                 // 1/1  P5.4 - EWR  -  сигналы выборки дискретных выходов(EWR)
                 // 1/1  P5.5 - ERD  -  сигналы выборки дискретных входов(ERD)
                 // 0/0  P5.6 - TIN  -  вход счетчика импульсов ПДФ
                 // 0/0  P5.7 - не используется

  DDR6 = 0x00;   // Аналоговые входы АЦП.

  DDR7 = 0x00;   // Шина данных портов ввода-вывода
  PDR7 = 0x00;

  DDR8 = 0xff;   // 1/1  - выходные ИУ моста (и.п.'1') + сумма
  PDR8 = 0xff;

  DDR9 = 0xf9;   // 1/1  P9.0        - CAN0: TXC0.
  PDR9 = 0x03;   // 0/1  P9.1        - CAN0: RXC0.
                 // 0/0  P9.2        - внешнее прерывание от геркона.
                 // 1/0  P9.3...P9.5 - не используется

  return   ;
}
/*─────────────────────────────────────-  */

