
/*--------------------------------------------------*/

    /*
     *  Âûäà÷à íà ÖÀÏ 10-òè ðàçðÿäíîãî êîäà, êîòîðûé ïîìåùàåòñÿ â ìëàäøèå
     *  10 ðàçðÿäîâ ñëîâà. Ñòàðøèå ðàçðÿäû íå èìåþò çíà÷åíèÿ.
     *
     *    Àäðåñ ÿ÷åéêè âûâîäèìîé íà ÖÀÏ çàäàåòñÿ ÷åðåç ñîîòâåòñòâóþùóþ
     *  óñòàâêó. Âûâîäèìàÿ ÿ÷åéêà äîëæíà áûòü â äîïîëíèòåëüíîì êîäå.
     *  ÖÀÏ îäíîïîëÿðíûé, ïîýòîìó äëÿ âûâîäà äâóïîëÿðíûõ ÷èñåë ââîäèòñÿ
     *  ñðåäíÿÿ íóëåâàÿ òî÷êà '+2047'. Çíà÷åíèå âûâîäèìîé ÿ÷åéêè
     *  ìàñøòàáèðóåòñÿ ïîñðåäñòâîì ñîîòâåòñâóþùåé óñòàâêè.
     *
     *       Òàáëèöà ñîîòâåòñòâèÿ êîäîâ è íàïðÿæåíèé ÖÀÏà :
     *    ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
     *       Íàïðÿæåíèå ³ Êîä çàïèñàííûé â ÖÀÏ  ³ Êîä ïåðåäàâàåìûé ìàêðîñó
     *      íà âûõîäå   ÃÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄ
     *       Öàïà, Â    ³    hex    ³    dec    ³    hex    ³    dec
     *    ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄ
     *        +5        ³   03.FF   ³  +1'023   ³   01.FF   ³  +0'511
     *         .        ³           ³           ³           ³
     *         .        ³           ³           ³           ³
     *         .        ³           ³           ³           ³
     *        +0        ³   02.00   ³  +0'512   ³   00.00   ³  +0'000
     *    ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄ
     *        -0        ³   01.FF   ³  +0'511   ³   FF.FF   ³  -0'001
     *         .        ³           ³           ³           ³
     *         .        ³           ³           ³           ³
     *         .        ³           ³           ³           ³
     *        -5        ³   00.00   ³  +0'000   ³   FE.00   ³  -0'512
     *                  ³           ³           ³           ³
     */


     //  Âûäà÷à äàííûõ â ÖÀÏû
//------------------
void  DAC_output ( word num )   // PPGX ,  ãäå Õ - íîìåð èñïîëüçóåìîãî PPG .
{
  register sword ax ;
  register word axh, axl ;

  switch ( num )
  {
    case 0 :  PPG_init( _PPG_for_DAC,0, 0 ) ;
              PPG_set( _PPG_for_DAC, _DAC_setka_max/2, _DAC_setka_max/2 ) ;
              PPG_start( _PPG_for_DAC,0 ) ;
      break;

    case 1 :
           //    Âûäà÷à íà ÖÀÏ ïëàòû ïðîöåññîðà.
        if (_or.dac_numb[0].var_num>=_DAC_Ntab2  ) _or.dac_numb[0].var_num = _DAC_Ntab2-1;
        ax = *DAC_tab2[_or.dac_numb[0].var_num].addr ;
                 // Màñøòàáèðîâàíèå.
              ax = (sw)( (slw)(sw)ax * (slw)(sw)_or.dac_numb[0].mashtab >> 8 ) ;

              ax += (sw)_or.dac_numb[0].offset ;

              if ( (sw)ax      > (sw)_DAC_setka_max ) ax = _DAC_setka_max ;
              else if ( (sw)ax < (sw)_DAC_setka_min ) ax = _DAC_setka_min ;

                //  Ïåðåâîäèì â êîä ØÈÌà ñîãëàñíî òàáëèöû âûøå.
              ax = _DAC_setka_max + ax ;
              axl = ax / 2 ;
                //    "- (ax & 0x01)"- ÷òîáû ïðè êîìïåíñèðîâàòü ïîòåðþ äèñêðåòû
                //  íà îêðóãëåíèå ïðè "/" ïðè ÷åòíûõ "ax" è íå ñíèæàòü
                //  äèñêðåòíîñòü ÖÀÏà ñ 1000 äî 500.
              axh = _DAC_setka_max - axl - (ax & 0x01) ;
              PPG_set( _PPG_for_DAC, axl, axh ) ;
      break;
  }

  return   ;
}

//--------------

void DAC_start (void)
{
  DAC_output ( 0 ) ;
  return   ;
}

void  DAC_Output ( void )
{
  DAC_output ( 1 ) ;
  return   ;
}
