
//         ПРОГРАММЫ ПРЕДВАРИТЕЛЬНОЙ ОБРАБОТКИ ВНЕШНИХ СИГНАЛОВ .
//------------------------------------------------------------------

        //  Все разрозненные сигналы собираем в один порт.
byte read_Pi1 ( void )
{
  register byte al ;
          //        ЪДДДДДДДДДДДДДДДДДДДДДДДДДДДДДP37
          //       і
          //      і                   ЪДДДДДДДВД Р12-Р10
          //   ЪДБДВДДДВДДДВДДДТДДДВДБДВДДДВДБДї
          //  і 7 і 6 і 5 і 4 є 3 і 2 і 1 і 0 і
          // АДДДБДДДБДДДБДДДРДДДБДДДБДДДБДДДЩ

          //   P37          //  P12-P10              P92
        al = (PDR3 & 0x80) |(PDR1&0x07);// | (PDR8 & 0x40) | ((PDR9 & 0x04)<<5) ;

  return al ;
}


/* Диагаамма аабовл дилмваа даебезга и помее.

    є ибеоднлй бигнал
    є   ЪДДДї    ЪДДДДДДДї ЪДДДДДДДДДДДДДДДДДДДї   ЪДДДДДї     ЪДДї
    є   і   і    і       і і                   і   і     і     і  і
    є   і   і    і       і і                   і   і     і     і  і
  ННОНННПНННПННННПНННННННПНПНННННННННННННННННННПНННПНННННПНННННПННПННННННННННН>
                                                                          t,o.e.

    є Д<Даанее блл задикбиаован "0"                      задикбиаован "0"Д>Дґ
    є                                ГД<Дзадикбиаована "1"
 по-* Д  Д  Д  Д  Д  Д  Д  Д  Д  Д   ЪДДДДДДДДДї   ЪДДДДДї     ЪДДї         і
рог є интегратора                  ЪДЩ         АДї і     АДї   і  АДї
    є   фильтра        ЪДї       ЪДЩ             АДЩ       АДї і    АДї     і
    є                ЪДЩ і     ЪДЩ                           АДЩ      АДї
    є     ЪДї      ЪДЩ   і   ЪДЩ                                        АДї
    є   ЪДЩ і    ЪДЩ     і ЪДЩ                                            АДї
  ННОНННПНННПННННПНННННННПНПННННННННННННННННННННННННННННННННННННННННННННННННПН>
                                                                          t,o.e.
    є
    є отфильтрованный сигнал         ЪДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДї
    є                                і                                      і
    є                                і                                      і
  ННОННННННННННННННННННННННННННННННННПННННННННННННННННННННННННННННННННННННННПН>
    є                                                                     t,o.e.
*/
//--------------------------------------------------------

//    Программа централизованной обработки внешних входных дискретных
//  сигналов.
//    Программа осуществляет нормализацию уровней, маскирование и
// антидребезг/фильтрацию сигналов.
//    Точность отслеживания постоянных времени фильтрации сигналов
// прямо пропорциональна частоте отработок данной программы .

void  Port_input ( word code )
{
    _register byte  al ;
    _register word  ax , bx ;
    _register lword  lax ;

        /*   Фиксация полного времени для данного момента.
         * Полное время состоит из показаний рабочего таймера и счетчика
         * его переполнений.
         * Дискрета рабочего таймера = 0.868мксек.
         * Дискрета счетчика переполнений рабочего таймера = 0.569сек.
         *  Алгоритм считывания показаний имеет особенность из-за того,
         * что считывание производится в два приема: считывание таймера и
         * считыание счетчика переполнений - а в интервале между считываниями
         * может иметь место переполнение таймера с переносом в счетчик.
         * Если последнее не учитывать, то будет вероятна ошибка считывания.
         *   Для учета данной особености считывания используется алгоритм
         * рекомендуемый в литературе для применения в 8-разрядных микро-
         * контроллерах для считывания показаний 16-разрядных таймеров.
         *   Алгоритм, применительно к нашему случаю, заключается в следующем:
         * 1. считывание счетчика переполнений => 'ax' ;
         * 2. считывание таймера => 'bx' ;
         * 3. сравнений счетчика переполнений с ранее считанным его значением
         *    хранящимся в 'ax' ;
         * 4. при несовпадении значений, что является признаком переполнения
         *    таймера между считываниями, возврат к пункту 1.
         */
    do { ax = Timer1_Ovr , bx = timer1 ; } while ( ax != Timer1_Ovr ) ;
    ax <<= 8 ;      //  Из четырехбайтного полного значения времени
    ax  += (bx>>8); // для работы берутся средние два байта прини-
                    // мающие значения в диапазоне 0.25мсек-12.0сек.

  switch ( code )
  {    //  Стартовая инициализация.
    case 0 :
        al = PDR7   ;
        Pi0_c.all = al ;
        Pi0_cf.all = al ;
        Pi0_nm.all = Pi0_f.all = al ^ _r.Pi0_Normal ;
        for ( bx = 0 ; bx < 8 ; bx++ )  P0_t[bx] = ax ;

            //  Все разрозненные сигналы собираем в один порт.
        al = read_Pi1 () ;
        Pi1_c.all = al ;
        Pi1_cf.all = al ;
        Pi1_nm.all = Pi1_f.all = al ^ _r.Pi1_Normal ;
        for ( bx = 0 ; bx < 8 ; bx++ )  P1_t[bx] = ax ;

      break;
    //---------------------
    default:
    case 1 :


/*ДДДДДДДДДДДДДДДД  Pi0  ДДДДДДДДДДДДДДДДДДД*/

//   Нормализация, т.е. приведение посредством уставки реальных активных
// уровней сигналов к общепринятому уровню активного сигнала, и маскирование
// заданных уставкой сигналов порта.
    al = PDR7   ;
     Pi0_c.all = al ,  al ^= _r.Pi0_Normal ;

//            Фильтрация дискретных сигналов портов .
//   Фильтрация осуществляется отдельно, как для каждого из портов,
// так и для отдельных сигналов в порту.

    lax = (lw)(w)Pi0_f.all << 24 ;
    lax += (lw)(w)Pi0_nm.all << 16;
    lax += (lw)(w)al << 8 ;

    for ( bx = 0 ; bx < 8 ; bx++ , lax >>= 1 )
       {
         if((lax & 0x1000000L) != 0)
          {
             if( (lax & 0x10100L) == 0 )
              {
                if ( ax - P0_t[ bx ] >= P0_tu[ bx ] )
                  {
                    P0_t[ bx ] = ax ;
                    lax &= 0xfeffffff ;
                  }
                continue ;
              }
             else  P0_t[ bx ] = ax ;
             continue ;
          }
         else
          {
             if( (lax & 0x10100L) == 0x10100L )
              {
                if ( ax - P0_t[ bx ] >= P0_tu[ bx ] )
                  {
                    P0_t[ bx ] = ax ;
                    lax |= 0x01000000 ;
                  }
                continue ;
              }
             else P0_t[ bx ] = ax ;
             continue ;
           }
       }
    //   Возвращение обработанных сигналов в память.
      Pi0_f.all = lax >> 16 ;
      Pi0_nm.all = lax;

           // Производим обратное инвертирование, чтобы получить
          // отфильтрованное, но ненормированное значение.
      Pi0_cf.all = Pi0_f.all ^ _r.Pi0_Normal ;
/*ДДДДДДДДДДДДДДДД  Pi1  ДДДДДДДДДДДДДДДДДДД*/

//   Нормализация, т.е. приведение посредством уставки реальных активных
// уровней сигналов к общепринятому уровню активного сигнала, и маскирование
// заданных уставкой сигналов порта.
    al = read_Pi1 () ;
     Pi1_c.all = al ,  al ^= _r.Pi1_Normal ;

//            Фильтрация дискретных сигналов портов .
//   Фильтрация осуществляется отдельно, как для каждого из портов,
// так и для отдельных сигналов в порту.

    lax = (lw)(w)Pi1_f.all << 24 ;
    lax += (lw)(w)Pi1_nm.all << 16;
    lax += (lw)(w)al << 8 ;

    for ( bx = 0 ; bx < 8 ; bx++ , lax >>= 1 )
       {
         if((lax & 0x1000000L) != 0)
          {
             if( (lax & 0x10100L) == 0 )
              {
                if ( ax - P1_t[ bx ] >= P1_tu[ bx ] )
                  {
                    P1_t[ bx ] = ax ;
                    lax &= 0xfeffffff ;
                  }
                continue ;
              }
             else  P1_t[ bx ] = ax ;
             continue ;
          }
         else
          {
             if( (lax & 0x10100L) == 0x10100L )
              {
                if ( ax - P1_t[ bx ] >= P1_tu[ bx ] )
                  {
                    P1_t[ bx ] = ax ;
                    lax |= 0x01000000 ;
                  }
                continue ;
              }
             else P1_t[ bx ] = ax ;
             continue ;
           }
       }
    //   Возвращение обработанных сигналов в память.
      Pi1_f.all = lax >> 16 ;
      Pi1_nm.all = lax;

           // Производим обратное инвертирование, чтобы получить
          // отфильтрованное, но ненормированное значение.
      Pi1_cf.all = Pi1_f.all ^ _r.Pi1_Normal ;
     /*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД*/
    break;
  }

  return  ;
}

/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД*/


        //  Все разрозненные сигналы собираем в один порт.
void  Port_output ( void )
{
  PDR3_P30 =  Po0_c._.n0;
  PDR3_P31 =  Po0_c._.n1;
  PDR3_P32 =  Po0_c._.n2;
  PDR3_P33 =  Po0_c._.n3;
  PDR3_P35 =  Po0_c._.n4;
  PDR5_P50 =  Po0_c._.n5;
  PDR5_P51 =  Po0_c._.n6;
  return  ;
}

      //  Для программ стартовой очистки выходных портов.
void  Port_output_clr ( void )
{
    Po0_c.all = 0 ;
    Port_output () ;
  return ;
}
