
// ------------------ ПРОГРАММА ОБЪЕКТНОГО РЕГУЛИРОВАНИЯ --------------------

word obj_ConfigReg ( word code )
{
  byte dh ;
  dh = 0 ;

  //  Здесь необходимо перечислить по "И" все ветки , зайти в которые нужно
  // независимо от выключенного объектного регулирования и наладочных режимов :
  // DAN 31.05.2016 15:00 - Задание тока выполняем всегда , и в Наладочных Режимах
  // тоже , т.к. АТК не могут работать по одному ...
  if ( code != _Obj_Init && code != _Obj_N_OS && code != _Obj_Id_Zad && code != _Obj_Id_Zad_Ogr ) // Инициализация и выбор ОС в любом случае .
    {
        // Задано ли объектное управление .
      if ( _r.Cfg._.Obj_prg == 0 || Isp.all != 0 ) return dh ;
    }
    //-----------

  switch ( code )
  {
            // Начальная инициализация.
    case _Obj_Init :
       break;
         //-------------

            // Задание на положение.
    case _Obj_S_Zad :
       break;
         //-------------

            // Задание на скорость.
    case _Obj_N_Zad :
       break;
         //-------------

            // Задание на скорость после ЗИ.
    case _Obj_N_Zad_R :

       // В случае необходимости , проверить полученное Объектное Задание
       // Скорости на превышение ограничений ( раскоментировать dh ) .
       // dh = 1 ;

       break;
         //-------------

            // Дополнительная ОС по скорости.
    case _Obj_N_OS :

       // Направление движения АД определяет Реверсор , который меняет фазы 6кВ на статоре .
       // Задание на входе РС всегда положительное , при реверсоре назад ОС по ПДФ инвертируется .
       // Т.о. противоход не теряется .
/*       if ( bo_canNazad == 1 )
       {
         SkorPDF = - PDF[0].out_m ;
       }
       else
       {
         SkorPDF = PDF[0].out_m ;
       }
*/
       // Выбор ОС :
       if ( _r.Sk_str._.PDF == 1 )        Skor = SkorPDF ; // По ПДФ при Реверсоре Назад скорость инвертированная .
       else/*if( _r.Sk_str._.EDS == 1 )*/ Skor = N_rot ;   // По ШИМ скорость всегда положительная .

       // В случае необходимости выполнить выбор объектной ОС вместо выбора штатной ОС
       // необходимо раскоментировать dh .
       dh = 1 ;

       break;
         //-------------

            // Задание на ток якоря.
    case _Obj_Id_Zad :

       // Ведомый АТК получает задание на ток ( точнее , неограниченный выход РС ) .
       // Флаг Ведомого - достаточное условие получения задания на РТ , флаг 2х двигатнельного проверять не нужно ...
       if ( flgO._.Vedushiy == 0 /*&& flgO._.Reg1dvig == 0*/ ) OuRegS_dop_kod = canId_zad ;

       // В режиме принудительной коммутации обнуляем задание на ток на 10-20 мс перед очередным ИУ ротора :
       if ( mAP2_Id_zad_null() ) 
       {
         OuRegS_dop_kod = 0 ;
         fr2 = 0x5555;
       }

       break;
         //-------------

            // Ограничение тока.
    case _Obj_Id_Zad_Ogr :

       // Для передачи от Ведущего к Ведомому - уже ограниченное задание на ток :
       OuRegS_ogr = OuRegS ;

       break;
         //-------------

            // Выполнение перед реверсом.
    case _Obj_Revers :
       // dh = 1 ; // чтобы не дать среверсироваться.
       break;
         //-------------

            // Задание на ток возбуждения.
    case _Obj_Iv_Zad :
       break;
         //-------------

            // Вход/выход из Останова.
    case _Obj_Ostanov :
       break;
         //-------------

            // Управление мех.тормозом.
    case _Obj_MT :
       break;
         //-------------

            // Задание на угол управления.
    case _Obj_Alfa_Zad :
       break;
         //-------------

            // Задание на напряжение генератора.
    case _Obj_Ug_Zad :
       break;
         //-------------

            // Задание на напряжение генератора после ЗИ и ограничений.
    case _Obj_Ug_Zad_R :

       // В случае необходимости , проверить полученное Объектное Задание
       // Напряжения на превышение ограничений ( раскоментировать dh ) .
       // dh = 1 ;

       break;
         //-------------
  }

  return dh ;
}
