

/*  Программа инициализации послед.порта, его прерывания и буферов для прерывания.  */

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xC0 ;  // 0/0  P0.0 - вход  F00 ПДФ
                 // 0/0  P0.1 - вход  F90 ПДФ
  PDR0 = 0xC0 ;  // 0/0  P0.2 - оборотный ПДФ
                 // 0/0  P0.3...P0.5 - входные EPA-сигналы.
                 // 1/1  P0.6        - i2c: SDA.
                 // 1/1  P0.7        - i2c: SCL.

  DDR1 = 0x6F ;  // 1/0  P1.0 - не используется.
  PDR1 = 0x3a;   // 1/1  P1.1 - выход сигнала Q2
                 // 1/0  P1.2 - выходной дискретный сигнал.
                 // 1/1  P1.3        - выходной Q1-сигнал.
                 // 0/1  P1.4        - CAN1: RXC1.
                 // 1/1  P1.5        - CAN1: TXC1.
                 // 1/0  P1.6        - USEL.
                 // 0/0  P1.7        - ОСТАНОВ.

#ifndef  _ext_ddr2   // Для возможности внешнего конфигурирования порта.
  #define  _ext_ddr2  0x0f
  #define  _ext_pdr2  0x0f
#endif
DDR2 = _ext_ddr2;// 1/1  P2.0...P2.3 - выходные CSi для S400 или ИУ тормозом/возбудителем (и.п.'1').
PDR2 = _ext_pdr2;// 0/0  P2.4        - неиспольз. или входные дискретные сигналы.
                 // 0/0  P2.5        - внешнее прерывание от геркона
                 // 0/0  P2.6...P2.7 - входы внешних прерываний


  DDR3 = 0xbf;   // 1/0  P3.0...P3.3 - выходные дискретные сигналы.
  PDR3 = 0x10;   // 1/1  P3.4        - UART0: TX0.
                 // 1/0  P3.5        - выходной дискретный сигнал.
                 // 0/0  P3.6        - UART0: RX0.
                 // 1/0  P3.7        - выходной дискретный сигнал.

  DDR4 = 0xdf;   // 1/1  P4.0...P4.4 - выходные сигналы (выборки к SSIO3).
  PDR4 = 0xdf;   // 0/0  P4.5        - SSIO3: IN.
                 // 1/1  P4.6        - SSIO3: CLK.
                 // 1/1  P4.7        - SSIO3: OUT.

  DDR5 = 0xbF;   // Порт PPG - изначально как выходы, а затем кому что надо.
  PDR5 = 0x00;   //  PPG1   - выходной дискретный сигнал(и.п.'0') или сумма для усредн..
                 //  PPG2/3 - частотное заполнение ИУ моста (и.п.'0').
                 //  PPG0/4 - частотное заполнение DAC0,1.
                 //  PPG5   - частотное заполнение DAC2 или ИУ торм. (и.п.'0').
                 //  0/0 P5.6   - TIN - вход счетного таймера, для ПДФ.

  DDR6 = 0x00;   // Аналоговые входы АЦП.

  DDR7 = 0x00;   // Порт 8-ми входных дискретных сигналов.

  DDR8 = 0xbf;   // 1/1  P8.0...P8.5 - выходные ИУ моста (и.п.'1').
  PDR8 = 0x3f;   // 0/0  P8.6        - входной дискр. сигнал.
                 // 1/0  P8.7        - не используется - выход.

  DDR9 = 0xf9;   // 1/1  P9.0        - CAN0: TXC0.
  PDR9 = 0x03;   // 0/1  P9.1        - CAN0: RXC0.
                 // 0/0  P9.2        - внешнее прерывание от геркона.
                 // 1/0  P9.3...P9.5 - выходы управления MUX-АЦП.

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

