

/*  Программа инициализации послед.порта, его прерывания и буферов для прерывания.  */

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

  DDR0 = 0xF4 ;  // 0/0  P0.0...P0.1 - входы режима программирования.
  PDR0 = 0x00 ;  // 1/0  P0.2 - не используется - выход
                 // 0/0  P0.3 - входной EPA-сигнал.
                 // 1/0  P0.4...P0.7 - не используется - выход

  DDR1 = 0xff ;  // 1/1  P1.0        - не используется - выход.
  PDR1 = 0xff ;  // 1/1  P1.1        - выходной разрешение ИУ(и.п.'1')
                 // 1/1  P1.2        - не используется - выход.
                 // 1/1  P1.3        - выходной Q1-сигнал.
                 // 1/1  P1.4   0/1  - CAN1: RXC1. не используется - выход.
                 // 1/1  P1.5        - CAN1: TXC1.
                 // 1/1  P1.6        - не используется - выход.
                 // 1/1  P1.7        - не используется - выход.


  DDR2 = 0xff;   // Порт 8-ми входных неиспользуемых прерываний.
  PDR2 = 0xff;

  DDR3 = 0xbf;   // 1/0  P3.0...P3.3 - выходные дискретные сигналы.
  PDR3 = 0x10;   // 1/1  P3.4        - UART0: TX0.
                 // 1/0  P3.5        - выход - не исп.
                 // 0/0  P3.6        - UART0: RX0.
                 // 1/0  P3.7        - выход - не исп.

  DDR4 = 0xff;   // Порт TXD1 - неиспользуется.
  PDR4 = 0xff;

  DDR5 = 0xFF;   // Порт PPG - изначально как выходы, а затем кому что надо.
  //PDR5 = 0x00; //  PPG2/3 - частотное заполнение ИУ моста (и.п.'0').
                 //  PPG0/4 - частотное заполнение ЦАП.
                 //  PPG5   - частотное заполнение ИУ торм. (и.п.'0').

  DDR6 = 0x80;   // Аналоговые входы АЦП - 7.

  DDR7 = 0xC0;   // Порт 6-ти входных дискретных сигналов.

  DDR8 = 0xff;   // Порт 6-ти выходных ИУ (и.п.'1').
  PDR8 = 0xff;

  DDR9 = 0xfd;   // 1/1  P9.0        - CAN0: TXC0.
  PDR9 = 0xff;   // 0/1  P9.1        - CAN0: RXC0.
                 // 1/1  P9.2        - не используется - выход.
                 // 1/1  P9.3        - i2c: SDA.
                 // 1/1  P9.4        - не используется - выход.
                 // 1/1  P9.5        - i2c: SCL.

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

