

//  Программа инициализации послед.порта, его прерывания и буферов для прерывания.

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xFC ;  // 0/1  P0.0...P0.1 - входы режима программирования.
  PDR0 = 0xFF ;  // 1/1  P0.2...P0.7 - ИУ

  DDR1 = 0x7C ;  // 0/0  P1.0        - синхронизация
  PDR1 = 0x7E ;  // 0/1  P1.1        - входной EPA1 (резерв)
                 // 1/1  P1.2, P1.3  - входные EPA2..EPA3(не используются-выход)
                 // 1/1  P1.4        - выход PPG0
                 // 1/1  P1.5        - выход PPG1 (резерв)
                 // 1/1  P1.6        - выход (mUSEL)
                 // 0/0  P1.7        - останов

  DDR2 = 0x00 ;  // 1/1  P2.0...P2.3 - не используется - вход
  PDR2 = 0xDF ;  // 0/1  P2.4        - вход 1VR
                 // 0/0  P2.5        - вход 1QK
                 // 0/1  P2.6        - дистанционный сброс
                 // 0/1  P2.7        - вход (резерв)

  DDR3 = 0xFF ;  // 1/0  P3.0...P3.5 - не используется - вход
  PDR3 = 0xFF ;  // 1/1  P3.6        - i2c: SCL.
                 // 1/1  P3.7        - i2c: SDA.

  DDR4 = 0x0E ;  // 0/0  P4.0        - UART0: RX1.
  PDR4 = 0xFE ;  // 1/1  P4.1        - выход - ПРЕДУПРЕЖДЕНИЕ
                 // 1/1  P4.2        - UART0: TX1.
                 // 1/1  P4.3        - CAN: TXC.
                 // 0/1  P4.4        - CAN: RXC.
/* Уже забит в функции Start_AD() AD_DRV.C
  DDR5 = 0x00 ;  // 0/0  P5.0        - АЦП вход - Id
  PDR5 = 0x00 ;  // 0/0  P5.1        - АЦП вход - Uз
                 // 0/0  P5.2        - АЦП вход - P24
                 // 0/0  P5.3        - АЦП вход - P12
                 // 0/0  P5.4        - АЦП вход - N12
                 // 0/0  P5.5...P5.7 - АЦП входы
*/
  DDR6 = 0x08 ;  // 0/0  P6.0        - вход KF - перегорание предохранителей
  PDR6 = 0x0A ;  // 0/1  P6.1        - вход INT0 - не используется
                 // 0/0  P6.2        - вход AVAR1 - авария РОТ
                 //                                 (аппаратная авария по Idmax)
                 // 1/1  P6.3        - выход AVAR - авария РОТ (как Q1V)

  return ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

