
//     ОБЪЕКТНЫЕ ПРОГРАММЫ.
//
//--------------------------------------------------------
//    Программа считывания кода текущего резерва для
//  перезагрузки уставок у многорезервных агрегатов.
word read_rezerv ( void )
  {
    register word ax ;

    // Для многорезервных агрегатов ОБЯЗАТЕЛЬНО следующее :
    //   1. На каждую область уставок ДОЛЖЕН БЫТЬ отдельный , самостоятельный дискретный вход .
    //   2. КАЖДЫЙ дискретный вход , для каждой области уставок , должен проверяться в условии .
    //   3. Дискретный вход для определения области уставок должен быть "= 1" , именно "1" ,
    // а не "0" , это важно .
    //   4. В типовых уставках установить инверсию дискретных входов "= 1" .
    //   5. Наличие "ax = 0" обязательно , для того , чтобы определять отсуствующий резерв .
    //   6. Для отсутствующего резерва применить либо "else" без проверки дискретных входов
    // (как в примере ниже) , либо проверить дискретные входы для отсуствующего резерва на "= 0" .
    //   7. В каждой области уставок необходимо будет принять и сохранить Типовые Уставки .

    //if      ( bi_KTE_rezerv1 == 1 ) ax = 1 ;
    //else if ( bi_KTE_rezerv2 == 1 ) ax = 2 ;
    //else                            ax = 0 ;

  // Для раздельной работы 12-пульсной схемы :
  #if defined(bi_Vedusch) && defined(bi_Vedom) && defined(bi_Both)
    if      ( bi_Vedusch == 1 && bi_Vedom == 0 && bi_Both == 0 ) ax = 2 ; // ШС1,ШС2
    else if ( bi_Vedusch == 0 && bi_Vedom == 1 && bi_Both == 0 ) ax = 3 ; //           ШС3,ШС4
    else if ( bi_Vedusch == 0 && bi_Vedom == 0 && bi_Both == 1 ) ax = 1 ; // ШС1,ШС2 + ШС3,ШС4
    else                                                         ax = 0 ;
  #else
    ax = 0 ; // если нет резерва
  #endif

    return ax ;
  }
//--------------------------------------------------------


//     ОБЪЕКТНАЯ ПРОГРАММА.

word  ObjPrg ( word num )
  {
    if ( num != _Obj_c_Init && num != _Obj_c_Common_avar ) // Инициализация и Общие Аварии в любом случае .
     {
        // Задано ли объектное управление .
      if ( _r.Cfg._.Obj_prg == 0 || Isp.all != 0 ) return 1 ;
     }
   //----
    switch ( num )
    {    // Стартовая объектная программа для задания начальных условий.
      case _Obj_c_Init :
        break;
        //-------
         // Объектная программа для задания начальных условий при переходе
        // из Работы в Сб.Готовности.
      case _Obj_c_DS1_Init :
        break;
        //-------
         // Объектная программа перед всеми защитами , например , для зарядки измерений .
      case _Obj_c_Common_avar :

        // Общие Аварии выполняются даже в наладочных режимах и при отключенном объектном управлении :

        break;
        //-------
         // Объектная программа для Сборки Готовности.
      case _Obj_c_Sborka_Gotovn :
         //    Для контроля задания скорости в Сборке Готовности необходимо прием задания
         // писать ниже , в работе , а здесь , в Сборке Готовности , закоменировать "break" .
        break;
        //-------
         // Объектная программа защит, неотключаемая после срабатывания защиты.
      case _Obj_c_Rabota :
        break;
        //-------
         // Объектная программа защит, отключаемая после срабатывания защиты.
      case _Obj_c_Avar_Otkl :
        break;
        //-------
    }

    return 0;
  }
/*--------------------------------------------------*/

