
// ------------------ ПРОГРАММА ОБЪЕКТНОГО РЕГУЛИРОВАНИЯ --------------------

word obj_ConfigReg ( word code )
{
  byte dh ;
  dh = 0 ;

  //  Здесь необходимо перечислить по "И" все ветки , зайти в которые нужно
  // независимо от выключенного объектного регилирования и наладочных режимов :
  if ( code != _Obj_Init && code != _Obj_N_OS ) // Инициализация и выбор ОС в любом случае .
    {
        // Задано ли объектное управление .
      if ( _r.Cfg._.Obj_prg == 0 || Isp.all != 0 ) return dh ;
    }
    //-----------

  switch ( code )
  {
            // Начальная инициализация.
    case _Obj_Init :
       break;
         //-------------

            // Задание на положение.
    case _Obj_S_Zad :
       break;
         //-------------

            // Задание на скорость.
    case _Obj_N_Zad :
       break;
         //-------------

            // Задание на скорость после ЗИ.
    case _Obj_N_Zad_R :

       // В случае необходимости , проверить полученное Объектное Задание
       // Скорости на превышение ограничений ( раскоментировать dh ) .
       // dh = 1 ;

       break;
         //-------------

            // Дополнительная ОС по скорости.
    case _Obj_N_OS :

       // В случае необходимости выполнить выбор объектной ОС вместо выбора штатной ОС
       // необходимо раскоментировать dh .
       // dh = 1 ;

       break;
         //-------------

            // Задание на ток якоря.
    case _Obj_Id_Zad :
       break;
         //-------------

            // Ограничение тока.
    case _Obj_Id_Zad_Ogr :
       break;
         //-------------

            // Выполнение перед реверсом.
    case _Obj_Revers :
       // dh = 1 ; // чтобы не дать среверсироваться.
       break;
         //-------------

            // Задание на ток возбуждения.
    case _Obj_Iv_Zad :
       break;
         //-------------

            // Вход/выход из Останова.
    case _Obj_Ostanov :
       break;
         //-------------

            // Управление мех.тормозом.
    case _Obj_MT :
       break;
         //-------------

            // Задание на угол управления.
    case _Obj_Alfa_Zad :
       break;
         //-------------

            // Задание на напряжение генератора.
    case _Obj_Ug_Zad :
       break;
         //-------------

            // Задание на напряжение генератора после ЗИ и ограничений.
    case _Obj_Ug_Zad_R :

       // В случае необходимости , проверить полученное Объектное Задание
       // Напряжения на превышение ограничений ( раскоментировать dh ) .
       // dh = 1 ;

       break;
         //-------------
  }

  return dh ;
}
