
//         ПРОГРАММЫ ПРЕДВАРИТЕЛЬНОЙ ОБРАБОТКИ ВНЕШНИХ СИГНАЛОВ .
//------------------------------------------------------------------

/* Диаграмма работы фильтра дребезга и помех.

    є исходный сигнал
    є   ЪДДДї    ЪДДДДДДДї ЪДДДДДДДДДДДДДДДДДДДї   ЪДДДДДї     ЪДДї
    є   і   і    і       і і                   і   і     і     і  і
    є   і   і    і       і і                   і   і     і     і  і
  ННОНННПНННПННННПНННННННПНПНННННННННННННННННННПНННПНННННПНННННПННПННННННННННН>
                                                                          t,o.e.

    є Д<Дранее был зафиксирован "0"                      зафиксирован "0"Д>Дґ
    є                                ГД<Дзафиксирована "1"
 по-* Д  Д  Д  Д  Д  Д  Д  Д  Д  Д   ЪДДДДДДДДДї   ЪДДДДДї     ЪДДї         і
рог є интегратора                  ЪДЩ         АДї і     АДї   і  АДї
    є   фильтра        ЪДї       ЪДЩ             АДЩ       АДї і    АДї     і
    є                ЪДЩ і     ЪДЩ                           АДЩ      АДї
    є     ЪДї      ЪДЩ   і   ЪДЩ                                        АДї
    є   ЪДЩ і    ЪДЩ     і ЪДЩ                                            АДї
  ННОНННПНННПННННПНННННННПНПННННННННННННННННННННННННННННННННННННННННННННННННПН>
                                                                          t,o.e.
    є
    є отфильтрованный сигнал         ЪДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДї
    є                                і                                      і
    є                                і                                      і
  ННОННННННННННННННННННННННННННННННННПННННННННННННННННННННННННННННННННННННННПН>
    є                                                                     t,o.e.
*/
//--------------------------------------------------------

//    Программа централизованной обработки внешних входных дискретных
//  сигналов.
//    Программа осуществляет нормализацию уровней, маскирование и
// антидребезг/фильтрацию сигналов.
//    Точность отслеживания постоянных времени фильтрации сигналов
// прямо пропорциональна частоте отработок данной программы .

void  Port_input ( word code )
{
     register byte  al ;
     register word  ax , bx, cx ;
     register lword  lax ;

        /*   Фиксация полного времени для данного момента.
         * Полное время состоит из показаний рабочего таймера и счетчика
         * его переполнений.
         * Дискрета рабочего таймера = 0.868мксек.
         * Дискрета счетчика переполнений рабочего таймера = 0.569сек.
         *  Алгоритм считывания показаний имеет особенность из-за того,
         * что считывание производится в два приема: считывание таймера и
         * считыание счетчика переполнений - а в интервале между считываниями
         * может иметь место переполнение таймера с переносом в счетчик.
         * Если последнее не учитывать, то будет вероятна ошибка считывания.
         *   Для учета данной особености считывания используется алгоритм
         * рекомендуемый в литературе для применения в 8-разрядных микро-
         * контроллерах для считывания показаний 16-разрядных таймеров.
         *   Алгоритм, применительно к нашему случаю, заключается в следующем:
         * 1. считывание счетчика переполнений => 'ax' ;
         * 2. считывание таймера => 'bx' ;
         * 3. сравнений счетчика переполнений с ранее считанным его значением
         *    хранящимся в 'ax' ;
         * 4. при несовпадении значений, что является признаком переполнения
         *    таймера между считываниями, возврат к пункту 1.
         */
    do { ax = Timer1_Ovr , bx = timer1 ; } while ( ax != Timer1_Ovr ) ;
    ax <<= 8 ;      //  Из четырехбайтного полного значения времени
    ax  += (bx>>8); // для работы берутся средние два байта прини-
                    // мающие значения в диапазоне 0.25мсек-12.0сек.

  switch ( code )
  {    //  Стартовая инициализация.
    case 0 :
         al = ( (((b)(LPC_GPIO2->PIN >> 11) & 0x07)       |           // 0й бит - Dint1 - разъём Х6/1
                                                                      // 1й бит - Dint2 - разъём Х6/2
                                                                      // 2й бит - Dint3 - разъём Х6/3
                (((b)(LPC_GPIO0->PIN >> 19) & 0x01) << 3) |           // 3й бит - Dint4 - разъём Х6/4
                (((b)(LPC_GPIO1->PIN >>  1) & 0x01) << 4) ) & 0x1F ); // 4й бит - KF - предохранитель вых.каскадов F2
        Pi0_c.all = al ;
        Pi0_cf.all = al ;
        Pi0_nm.all = Pi0_f.all = al ^ _r.Pi0_Normal ;

        for ( bx = 0 ; bx < 8 ; bx++ )
         {
           P0_t[bx] = ax ;
         }

      break;
    //---------------------
    default:
    case 1 :


/*ДДДДДДДДДДДДДДДД  Pi0  ДДДДДДДДДДДДДДДДДДД*/

//   Нормализация, т.е. приведение посредством уставки реальных активных
// уровней сигналов к общепринятому уровню активного сигнала, и маскирование
// заданных уставкой сигналов порта.
         al = ( (((b)(LPC_GPIO2->PIN >> 11) & 0x07)       |           // 0й бит - Dint1 - разъём Х6/1
                                                                      // 1й бит - Dint2 - разъём Х6/2
                                                                      // 2й бит - Dint3 - разъём Х6/3
                (((b)(LPC_GPIO0->PIN >> 19) & 0x01) << 3) |           // 3й бит - Dint4 - разъём Х6/4
                (((b)(LPC_GPIO1->PIN >>  1) & 0x01) << 4) ) & 0x1F ); // 4й бит - KF - предохранитель вых.каскадов F2
     Pi0_c.all = al ,  al ^= _r.Pi0_Normal ;

//            Фильтрация дискретных сигналов портов .
//   Фильтрация осуществляется отдельно, как для каждого из портов,
// так и для отдельных сигналов в порту.

    lax = (lw)(w)Pi0_f.all << 24 ;
    lax += (lw)(w)Pi0_nm.all << 16;
    lax += (lw)(w)al << 8 ;

    for ( bx = 0 ; bx < 8 ; bx++ , lax >>= 1 )
       {
         if((lax & 0x1000000L) != 0)
          {
             if( (lax & 0x10100L) == 0 )
              {
                cx = ax - P0_t[ bx ];
                if ((u)cx  >= P0_tu[ bx ] )
                  {
                    P0_t[ bx ] = ax ;
                    lax &= 0xfeffffff ;
                  }
                continue ;
              }
             else  P0_t[ bx ] = ax ;
             continue ;
          }
         else
          {
             if( (lax & 0x10100L) == 0x10100L )
              {
                cx = ax - P0_t[ bx ];
                if ( (u)cx >= P0_tu[ bx ] )
                  {
                    P0_t[ bx ] = ax ;
                    lax |= 0x01000000 ;
                  }
                continue ;
              }
             else P0_t[ bx ] = ax ;
             continue ;
           }
       }
    //   Возвращение обработанных сигналов в память.
      Pi0_f.all = lax >> 16 ;
      Pi0_nm.all = lax;

           // Производим обратное инвертирование, чтобы получить
          // отфильтрованное, но ненормированное значение.
      Pi0_cf.all = Pi0_f.all ^ _r.Pi0_Normal ;


    break;
  }

  return  ;
}

/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД*/


        //  Все разрозненные сигналы собираем в один порт.
void  Port_output ( void )
{
    lword lax;
#ifndef _Po0_INVERT      // Имеется возможность инверсии выходных сигналов .
  Po0_nm.all = Po0_c.all ; // Заглушка при отсуствии инвертирования .
#else
  Po0_nm.all = Po0_c.all ^ _r.Po0_Normal ; // Нормализация выходных сигналов .
#endif
asm_di();
  lax = (lw)(!Po0_nm._.n0 << 17) | // 0й бит - DO1 - разъём Х8/1-2
        (lw)(!Po0_nm._.n1 << 16) | // 1й бит - DO2 - разъём Х8/3-4
        (lw)(!Po0_nm._.n2 << 15) | // 2й бит - DO3 - разъём Х8/5-6
        (lw)(!Po0_nm._.n3 << 14) | // 3й бит - DO4 - разъём Х8/7-8
        (lw)(Po0_nm._.n4 <<  9) |  // 4й бит - Red - светодиод V5
        (lw)(Po0_nm._.n5 <<  8) |  // 5й бит - Yellow - светодиод V4
        (lw)(Po0_nm._.n6 <<  4);   // 6й бит - Green - светодиод V3
  LPC_GPIO1->SET =  lax & 0x0003c310;
  LPC_GPIO1->CLR = ~lax & 0x0003c310;
asm_ei();
  return  ;
}

      //  Для программ стартовой очистки выходных портов.
void  Port_output_clr ( void )
{
    Po0_c.all = 0 ;
    Port_output () ;
  return ;
}
