
//
//     Инициализация PPG в 16-ти разрядный режим с заданием его
//   номера, делителя базовой частоты и исходного выходного уровня.
//     PPG остается в отключенном состоянии.
//
//  clk:  4 -  1.00 мкс  (16МГц/16)
//        3 -  0.50 мкс
//        2 -  0.25 мкс
//        1 -  0.125мкс
//        0 -  0.063мкс

void  PPG_init( byte n, byte clk, byte lev)
{
      switch ( n )
      {
        case 0 :
                 if ( lev == 1 ) PDR5_P50 = 1;
                 else            PDR5_P50 = 0;
                 DDR5_D50 = 1;

               //для 16-разрядного реж.  PPG01_PCS = clk;   // Частота счета
                 PPG01_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //  для 16-разрядного реж. запись нужно производить словом,
                    // иначе по подаче питания PPG глючит и начинает работать
                    // только после перезапуска при поданном питании.
                 *(w*)&PPGC0 = 0x0707;
                 //PPGC1 = 0x87;
               break;
              //------------
        case 1 :
                 if ( lev == 1 ) PDR5_P51 = 1;
                 else            PDR5_P51 = 0;
                 DDR5_D51 = 1;

                 //PPG23_PCS = clk;   // Частота счета
                 PPG23_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGC2 = 0x0707;
                 //PPGC3 = 0x87;               // enable PPG operation
               break;
              //------------
        case 2 :
                 if ( lev == 1 ) PDR5_P52 = 1;
                 else            PDR5_P52 = 0;
                 DDR5_D52 = 1;

                 //PPG45_PCS = clk;   // Частота счета
                 PPG45_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGC4 = 0x0707;
                 //PPGC5 = 0x87;               // enable PPG operation
               break;
              //------------
        case 3 :
                 if ( lev == 1 ) PDR5_P53 = 1;
                 else            PDR5_P53 = 0;
                 DDR5_D53 = 1;

                 //PPG67_PCS = clk;   // Частота счета
                 PPG67_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGC6 = 0x0707;
                 //PPGC7 = 0x87;               // enable PPG operation
               break;
              //------------
        case 4 :
                 if ( lev == 1 ) PDR5_P54 = 1;
                 else            PDR5_P54 = 0;
                 DDR5_D54 = 1;

                 //PPG89_PCS = clk;   // Частота счета
                 PPG89_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGC8 = 0x0707;
                 //PPGC9 = 0x87;               // enable PPG operation
               break;
              //------------
        case 5 :
                 if ( lev == 1 ) PDR5_P55 = 1;
                 else            PDR5_P55 = 0;
                 DDR5_D55 = 1;

                 //PPGAB_PCS = clk;   // Частота счета
                 PPGAB_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGCA = 0x0707;
                 //PPGCB = 0x87;               // enable PPG operation
               break;
              //------------
      }

  return ;
}


//
//     Инициализация частоты PPG с заданием его номера, уровня нуля и
//   единицы. PPG остается в отключенном состоянии.
//
void  PPG_set( byte n, word low, word high )
{
   if ( low  != 0 )   low-- ;  //  корректировка, т.к. PPG
   if ( high != 0 )  high-- ;  // автоматически добавляет одну дискрету.

      switch ( n )
      {
        case 0 :
                    //  в 16-ти разрядном режиме данные провалятся в
                   //  PRLL0, PRLH0 только после последней команды.
                 PRLL0 = low  ;       //  младший байт для "0".
                 PRLH0 = high ;       //  младший байт для "1".
                 //PRLL1 = low  >> 8 ;  //  старший байт для "0"
                 //PRLH1 = high >> 8 ;  //  старший байт для "1"
                   // Для того, чтобы все записывалось одной командой.
                 *(w*)&PRLL1 = (low >> 8) | (high & 0xff00) ;

               break;
              //------------
        case 1 :
                 PRLL2 = low  ;
                 PRLH2 = high ;
                 *(w*)&PRLL3 = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
        case 2 :
                 PRLL4 = low  ;
                 PRLH4 = high ;
                 *(w*)&PRLL5 = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
        case 3 :
                 PRLL6 = low  ;
                 PRLH6 = high ;
                 *(w*)&PRLL7 = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
        case 4 :
                 PRLL8 = low  ;
                 PRLH8 = high ;
                 *(w*)&PRLL9 = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
        case 5 :
                 PRLLA = low  ;
                 PRLHA = high ;
                 *(w*)&PRLLB = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
      }

  return ;
}


//
//     Запуск PPG с заданием его номера.
//
void  PPG_start( byte n, byte s )
{
      byte bh1,bh2;
      switch ( n )
      {
        case 0 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLL0;
                 bh2 = PRLL1;
                 PRLL0 = s;
                 PRLL1 = 0;
                *(w*)&PPGC0 |= 0xA080;
                 PRLL0 = bh1;
                 PRLL1 = bh2;

                 //PPGC0 |= 0x20;     //  нулеве каналы не подключены к выходам.
                 //PPGC1 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 1 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLL2;
                 bh2 = PRLL3;
                 PRLL2 = s;
                 PRLL3 = 0;
                *(w*)&PPGC2 |= 0xA080;
                 PRLL2 = bh1;
                 PRLL3 = bh2;
                 //PPGC2 |= 0x20;
                 //PPGC3 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 2 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLL4;
                 bh2 = PRLL5;
                 PRLL4 = s;
                 PRLL5 = 0;
                *(w*)&PPGC4 |= 0xA080;
                 PRLL4 = bh1;
                 PRLL5 = bh2;
                 //PPGC4 |= 0x20;
                 //PPGC5 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 3 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLL6;
                 bh2 = PRLL7;
                 PRLL6 = s;
                 PRLL7 = 0;
                *(w*)&PPGC6 |= 0xA080;
                 PRLL6 = bh1;
                 PRLL7 = bh2;
                 //PPGC6 |= 0x20;
                 //PPGC7 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 4 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLL8;
                 bh2 = PRLL9;
                 PRLL8 = s;
                 PRLL9 = 0;
                *(w*)&PPGC8 |= 0xA080;
                 PRLL8 = bh1;
                 PRLL9 = bh2;
                 //PPGC8 |= 0x20;
                 //PPGC9 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 5 :
                 //Синхронизация комманды старт - чтобы стартовало
                 //с единицы
                 bh1 = PRLLA;
                 bh2 = PRLLB;
                 PRLLA = s;
                 PRLLB = 0;
                *(w*)&PPGCA |= 0xA080;
                 PRLLA = bh1;
                 PRLLB = bh2;
                 //PPGCA |= 0x20;
                 //PPGCB |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
      }
  //mUSEL_set() ;
  return ;
}


//
//     Остановка PPG с заданием его номера и исходного выходного
//   уровня.
//
void  PPG_stop( byte n, byte lev )
{
      switch ( n )
      {
        case 0 :
                 //PPGC0 &= ~0x20;
                 //PPGC1 &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGC0 &= ~0xa080; // должно быть до задания уровня, чтобы не проскакивала
                                         // единица между импульсами суммы
                                         // ( обнаружено в Луцке , в январе 2010 , Головиным )
                 PDR5_P50 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
        case 1 :
                 //PPGC2 &= ~0x20;
                 //PPGC3 &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGC2 &= ~0xa080;
                 PDR5_P51 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
        case 2 :
                 //PPGC4 &= ~0x20;
                 //PPGC5 &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGC4 &= ~0xa080;
                 PDR5_P52 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
        case 3 :
                 //PPGC6 &= ~0x20;
                 //PPGC7 &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGC6 &= ~0xa080;
                 PDR5_P53 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
        case 4 :
                 //PPGC8 &= ~0x20;
                 //PPGC9 &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGC8 &= ~0xa080;
                 PDR5_P54 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
        case 5 :
                 //PPGCA &= ~0x20;
                 //PPGCB &= ~0x20;   // отключаем PPG от выхода.
                 *(w*)&PPGCA &= ~0xa080;
                 PDR5_P55 = lev ;  // задаем предварительно требуемый уровень выхода.
               break;
              //------------
      }

  return ;
}

