

//  Программа инициализации послед.порта, его прерывания и буферов для прерывания.
// DDR = 0 - input, DDR = 1 - output
void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены
  DDR0 = 0xFC ;
  PDR0 = 0xff;
  DDR1 = 0xf0 ;
  PDR1 = 0xEe;
  DDR2 =0x00 ;
  PDR2 = 0;
  DDR3 =0xC0 ;
  PDR3 =0xC0;//i2c :p36-SCL, p37-SDA
  DDR4 = 0x06 ;  // enable SOT1 (00000110)
  PDR4_P41 = 1;

  DDR5 = 0x00 ;  // АЦП входы - для начала, как дискретные входы
  DDR6 =0x00 ;

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

