#include "CRC16.h"

/*-----------------28.04.2011 16:03-----------------
—начала передатчик должен подсчитать контрольную сумму своего сообщени€.
ƒлина сообщени€ равна, например 5 байт.
«атем передатчик передает (сообщение + контрольна€ сумма 2 байта)
  всего длиной 7 байт.
«атем приемник принимает это сообщение длиной в 7 байт и проделывает
операцию аналогично передатчику, но обрабатывает уже 7 байт
в результате в регистре (crc) должен получитьс€ 0.
--------------------------------------------------*/
word CRC16(byte* data, lword length)
{
  byte nIndex;
  lword crc = 0xFFFF;

    while (length--)
    {
       nIndex = *data++ ^ crc;
       crc >>= 8;
       crc ^= CRCT16Table[nIndex];
    }
    return crc;
}
//-----------------------------------------------------------------------------
