

//     ПРОГРАММА ЗАПУСКА АЦП НА ИЗМЕРЕНИЕ.
//     Т.к. время преобразования АЦП всего 6мксек то прерывания
//  по готовности АЦП и организация очереди при наложении измерений
//  не предусматриваются.
//--------------------------------------------------------

  //  Программа инициализации АЦП без его прерывания и буферов для прерывания.

void  Start_AD ( void )
  {
//    OutAdBuffCount = 0 ;
//    InAdBuffCount  = 1 ;
//    Flg.NoAdBuffInfo  = 1 ;

         // Настройка pin-ов, как дискретных входов.
    DDR5 = 0x00 ;
         // Донастройка pin-ов, как аналоговых входов.
    ADER = 0xFF ;

         //  Настройка времени захвата 2.0мкс и преобразования 5.5мкс АЦП.
    ADCR0  = 0x3000 ;
     // S10=0 ,ST1=0 ,ST0=1 ,CT1=1 ,CT0=0 ,RES=0 ,D9...D0=0

    return ;
 }

/*   Функция для запуска измерения - использует внутри себя аналогичный
 * макрос - из-за чего ремя ее выполнения больше, чем макроса, но затраты
 * памяти при ее использовании меньше ( экономится 105 байт на один вызов ).
 *   Ее имеет смысл использовать в программах не требовательных ко времени.
 */
void  AD_Izm( struct Channel_AD ach , word* AddrResult )
{
  mAD_Izm( ach , AddrResult ) ;
  return ;
}
