

/*  Программа инициализации послед.порта, его прерывания и буферов для прерывания.  */

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xF4 ;  // 0/0  P0.0...P0.1 - входы режима программирования.
  PDR0 = 0xC0 ;  // 1/0  P0.2 - не используется - выход
                 // 0/0  P0.3 - входной EPA-сигнал.
                 // 1/0  P0.4...P0.5 - не используется - выход
                 // 1/1  P0.6        - i2c: SDA.
                 // 1/1  P0.7        - i2c: SCL.

  DDR1 = 0x6F ;  // 1/0  P1.0...P1.2 - не используется - выход.
  PDR1 = 0x38;   // 1/1  P1.3        - выходной Q1-сигнал.
                 // 0/1  P1.4        - CAN1: RXC1.
                 // 1/1  P1.5        - CAN1: TXC1.
                 // 1/0  P1.6        - USEL.
                 // 0/0  P1.7        - ОСТАНОВ.

  DDR2 = 0xFF;   // Порт не используется - выход.
  PDR2 = 0x00;

  DDR3 = 0x3f;   // 1/0  P3.0...P3.3 - выходные дискретные сигналы.
  PDR3 = 0x10;   // 1/1  P3.4        - UART0: TX0.
                 // 1/0  P3.5        - выходной дискретный сигнал.
                 // 0/0  P3.6        - UART0: RX0.
                 // 0/0  P3.7        - входной сигнал (предохр.вых.каск.)

  DDR4 = 0xdf;   // 1/1  P4.0...P4.4 - выходные сигналы (выборки к SSIO3).
  PDR4 = 0xdf;   // 0/0  P4.5        - SSIO3: IN.
                 // 1/1  P4.6        - SSIO3: CLK.
                 // 1/1  P4.7        - SSIO3: OUT.

  DDR5 = 0xFF;   // Порт PPG - изначально как выходы, а затем кому что надо.
  //PDR5 = 0x00; //  PPG2/3 - частотное заполнение ИУ моста (и.п.'0').
                 //  PPG0/4 - частотное заполнение ЦАП.
                 //  PPG5   - частотное заполнение ИУ торм. (и.п.'0').

  DDR6 = 0x00;   // Аналоговые входы АЦП.

  DDR7 = 0x00;   // Порт 8-ми входных дискретных сигналов.

  DDR8 = 0xff;   // 1/1  P8.0...P8.5 - выходные ИУ моста (и.п.'1').
  PDR8 = 0x3f;   // 1/0  P8.6...P8.7 - не используется - выход.

  DDR9 = 0xfd;   // 1/1  P9.0        - CAN0: TXC0.
  PDR9 = 0x03;   // 0/1  P9.1        - CAN0: RXC0.
                 // 1/0  P9.2...P9.5 - не используется - выход.

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

