
//  Программа инициализации послед.порта, его прерывания и буферов для прерывания.
//  DDR = 0- input, = 1-output

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

               // DDR/PDR
  DDR0 = 0xBC ;  // 0/0  P0.0...P0.1 - входы режима программирования.
  PDR0 = 0x00 ;  // 1/0  P0.2...P0.5 - не используется - выход
                 // 0/0  P0.6        - ОСТАНОВ.
                 // 1/0  P0.7        - USEL.

  DDR1 = 0x50 ;  // 0/0  P1.0...P1.3 - входные EPA0...EPA3
  PDR1 = 0x00 ;  // 1/0  P1.4        - выход PPG0
                 // 0/0  P1.5        - не используется - вход (закорочен с P1.4)
                 // 1/0  P1.6        - выход PPG1.
                 // 0/0  P1.7        - не используется - вход (закорочен с P1.7)

  DDR2 = 0x0A ;  // 0/0  P2.0        - вход TIN0
  PDR2 = 0x00 ;  // 1/0  P2.1        - не используется - выход
                 // 0/0  P2.2        - вход TIN1
                 // 1/0  P2.3        - не используется - выход
                 // 0/0  P2.4...P2.7 - входы INT4...7

  DDR3  = 0xFB ; // 1/1  P3.0        - SSIO: OUT.
  PDR3  = 0xCB ; // 1/1  P3.1        - SSIO: CLK.
                 // 0/0  P3.2        - SSIO: IN.
                 // 1/1  P3.3        - выход выборки
                 // 1/0  P3.4...P3.5 - не используется - выход
                 // 1/1  P3.6        - i2c: SCL.
                 // 1/1  P3.7        - i2c: SDA.

  DDR4  = 0x0E;  // 0/0  P4.0        - UART0: RX1.
  PDR4  = 0xFC;  // 1/0  P4.1        - не используется - выход
//PDR4_P41 = 1;  // 1/1  P4.2        - UART0: TX1.
                 // 1/1  P4.3        - CAN: TXC.
                 // 0/1  P4.4        - CAN: RXC.

  DDR5 = 0xC5;   // 1/0  P5.0        - не используется - выход
  PDR5 = 0x00;   // 0/0  P5.1        - АЦП вход.
                 // 1/0  P5.2        - не используется - выход
                 // 0/0  P5.3...P5.5 - АЦП входы.
                 // 1/0  P5.6...P5.7 - не используется - выход

  DDR6 = 0x04;   // 0/0  P6.0        - вход INT0
  PDR6 = 0x00;   // 0/0  P6.1        - вход INT1
                 // 1/0  P6.2        - не используется - выход
                 // 0/0  P6.3        - вход INT3
  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

