
void  Init_CPU_Ports ( void )
{
  __set_il(31); //qwer  // set global int-level

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PFRx": 1 - функц. 0 - общего назначен.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

//--------------   Порт 27   -------------------
  // Порт 27 - внутренний порт процессора .
PFR27 = 0;  //необходимо обнулять, иначе порты Р74,Р75 работать не будут
//----------------------------------------------

//--------------   Порт 7   --------------------
  // Дискретные выходы на портах Р74,Р75
  // на "чипе" находятся порты только Р74-Р76
  // Р77 используется как CS7 для CAN
  DDR7 = 0x30; // 0011 0000
  PFR7 = 0;
  PDR7 = 0;
//----------------------------------------------

//--------------   Порт 8   --------------------
  // используются только порты Р83,Р84 для внешнего
  // чтения/записи
  DDR8 = 0;    // 1101 1000
  // включены как функциональные кроме Р83,Р84
  // также Р87,Р86,Р83,Р80 для CAN
  PFR8 = 0xF9; // 1111 1001
               // bit 7 - WR3X
               // bit 6 - WR2X
               // bit 5 - WR1X
               // bit 4 - WR0X
               // bit 3 - RDX
               // bit 0 - RDY
//----------------------------------------------

//--------------   Порт 9   --------------------
  // порты Р90,Р91 используются как дискретные
  // выходы
  // порты Р94,Р95 - CS0,CS1 не используются
  // порт Р96 используется как CS2 для выбора
  // внешнего RAM
  // порт Р97 используется для работы
  // усреднителей аналоговых сигналов
  DDR9 = 0xF3; // C3 1100 0011
  PFR9 = 0x54; //    0101 0100 24.10.06 10:01
               // bit 3 - выход CLK
//PDR9 = 0x40; //    0100 0000  // P94-P97 -> CS0-CS3
  //PDR9_PD97 = 0 ;            24.10.06 10:01
//----------------------------------------------

//--------------   Порт В   --------------------
  //DREQ
  DDRB_DDB0 = 0;
  PFRB_PFB0 = 1;

  //Для ПДФ.
  DDRB_DDB1 = 0;
  PFRB_PFB1 = 0;

  //USEL
  DDRB_DDB2 = 1;
  PFRB_PFB2 = 0;
//-----------------------------------------------

//--------------   Порт I   ---------------------
  // на "чипе" существует только один бит порта I - PI3
  //Останов
  DDRI_DDI3 = 0;
  PFRI_PFI3 = 0;
//-----------------------------------------------

//--------------   Порт J   ---------------------
  //Дискретные входы
  DDRJ = 0;
  PFRJ = 0;
//-----------------------------------------------

//--------------   Порт K   ---------------------
 //INT0-INT7
  DDRK = 0;
  PFRK = 0xff;
  // INT0 - ПДФ: (FX0+FX1) - DREQ0
  // INT1 - ПДФ: FZ
  // INT2 - ДЗВА1
  // INT3 - ДЗВК1
  // INT4 - ДЗВА2
  // INT5 - ДЗВК2
  // INT6 - Геркон 1В
  // INT7 - Геркон 2В
//-----------------------------------------------

//--------------   Порт L -----------------------
  // PL3-PL0 - EPA компаратор синхронизации
  // PL3 - ПДФ FX0 или EPA компаратор синхронизации
  // PL5,PL4 - дискетные выходы Q2,Q1
  // PL7-PL6 - дискетные выходы
  DDRL = 0xf0;
  PFRL = 0x0f;
  PDRL = 0x30 ;  //
//-----------------------------------------------

//--------------   Порт M   ---------------------
  // PM3,PM2 используются как функциональные - i2c
  // PM1,PM0 используются как выходы выборок CS4,CS3
  // для SIO ( платы S200,S400 )
  DDRM = 0xFF;
  PFRM = 0x0C;
  PDRM_PDM0 = 1 ; // CS3
  PDRM_PDM1 = 1 ; // CS4
//-----------------------------------------------

//--------------   Порт N   ---------------------
  // PN5-PN0 используются для плат SIO ( S200,S400 )
  // Если PN5-PN3 функциональные - то SIO последовательный ( S200,S400 )
  // Если PN5-PN3 общ.назначения - то SIO параллельный ( плата еще не готова )
  DDRN = 0x37; // 0011 0111
               // bit 5 - SCK3
               // bit 4 - SOT3
               // bit 3 - SIN3
//PFRN = 0x00; // 0000 0000 - параллельный
  PFRN = 0x38; // 0011 1000 - последовательный
  PDRN_PDN0 = 1 ; // CS0
  PDRN_PDN1 = 1 ; // CS1
  PDRN_PDN2 = 1 ; // CS2
//-----------------------------------------------

//--------------   Порт О   ---------------------
  //PPG
  DDRO = 0xff;
  PDRO = 0x70;
 // PFRO = 0xff;
//-----------------------------------------------

//--------------   Порт Р   ---------------------
  // все используется под 3 CAN
#ifdef  _NOT_P5_CAN2    // Если CAN2 не используется и не подтянут на +5В :
  DDRP = 0x20; // 0010 0000 - RXC2 выход .
  PFRP = 0xDF; // 1101 1111 - RXC2 общего назначения .
#else
  DDRP = 0;
  PFRP = 0xff;
#endif
               /* CAN Port */
               // bit 5 - RXC2
               // bit 4 - TXC2
               // bit 3 - RXC1
               // bit 2 - TXC1
               // bit 1 - RXC0
               // bit 0 - TXC0
//-----------------------------------------------

//--------------   Порт Q   ---------------------
  // используется только UART0 - PQ1,PQ0
  // PQ2 , PQ3 - используются для выборок плат S200,S400
  // PQ4 , PQ5 - используются для выборок плат S200,S400
  // остальные биты зарезервированы как входы или
  // в фунуциональном режиме - UART1, UART2
  DDRQ = 0x3C ;//00111100
  PFRQ = 0 ;

  PFRQ_PFQ0 = 1;    // Serial Input Pin  - SIN0
  PFRQ_PFQ1 = 1;    // Serial Output Pin - SOT0

  PDRQ_PDQ4 = 1 ; // CS5
  PDRQ_PDQ5 = 1 ; // CS6

  PDRQ_PDQ2 = 1 ; // CS7
  PDRQ_PDQ3 = 1 ; // CS8
  /* UART Port */
  // bit 5 - RX2 или дискр.вход-выход (X2)
  // bit 4 - TX2 или дискр.вход-выход (X2)
  // bit 3 - RX1
  // bit 2 - TX1
  // bit 1 - RX0
  // bit 0 - TX0
//-----------------------------------------------

//--------------   Порт R   ---------------------
  // импульсы якоря
  DDRR = 0x3f;
  PFRR = 0;
  PDRR = 0x3f;
//-----------------------------------------------

//--------------   Порт S   ---------------------
  // импульсы тормоза или возбудителя
  DDRS = 0x3f;
  PFRS = 0;
  PDRS = 0x3f;
//-----------------------------------------------

  return;
}
