
//************     16-ти РАЗРЯДНЫЕ "PPG"       *************


//      "PPG" ДЛЯ 497-го ТАКИЕ ЖЕ КАК И ДЛЯ 590-го, ТОЛЬКО МЕНЬШЕ КАНАЛОВ.
//                   -------------------------------------
//
//  Используем в отличие от 590-го выводы "PPG0" для совместимости
// с платой возбудителя, где на частотное заполнение выведен вывод "PPG0".

//     Инициализация PPG в 16-ти разрядный режим с заданием его
//   номера, делителя базовой частоты и исходного выходного уровня.
//     PPG остается в отключенном состоянии.
//
//  clk:  4 -  1.00 мкс  (16МГц/16)
//        3 -  0.50 мкс
//        2 -  0.25 мкс
//        1 -  0.125мкс
//        0 -  0.063мкс

void  PPG_init( byte n, byte clk, byte lev)
{
      switch ( n )
      {
        case 0 :
                 if ( lev == 1 ) PDR1_P14 = 1;
                 else            PDR1_P14 = 0;
                 DDR1_D14 = 1;

               //для 16-разрядного реж.  PPG01_PCS = clk;   // Частота счета
                 PPG01_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //  для 16-разрядного реж. запись нужно производить словом,
                    // иначе по подаче питания PPG глючит и начинает работать
                    // только после перезапуска при поданном питании.
                 *(w*)&PPGC0 = 0x8781;
                 //PPGC1 = 0x87;
               break;
              //------------
        case 1 :
                 if ( lev == 1 ) PDR1_P16 = 1;
                 else            PDR1_P16 = 0;
                 DDR1_D16 = 1;

                 //PPG23_PCS = clk;   // Частота счета
                 PPG23_PCM = clk;   // Частота счета
                     // enable PPG operation без подключения к выходу.
                    //для 16-разрядного реж.  запись нужно производить словом.
                 *(w*)&PPGC2 = 0x8781;
                 //PPGC3 = 0x87;               // enable PPG operation
               break;
              //------------
      }

  return ;
}


//
//     Инициализация частоты PPG с заданием его номера, уровня нуля и
//   единицы. PPG остается в отключенном состоянии.
//
void  PPG_set( byte n, word low, word high )
{
   if ( low  != 0 )   low-- ;  //  корректировка, т.к. PPG
   if ( high != 0 )  high-- ;  // автоматически добавляет одну дискрету.

      switch ( n )
      {
        case 0 :
                    //  в 16-ти разрядном режиме данные провалятся в
                   //  PRLL0, PRLH0 только после последней команды.
                 PRLL0 = low  ;       //  младший байт для "0".
                 PRLH0 = high ;       //  младший байт для "1".
                 //PRLL1 = low  >> 8 ;  //  старший байт для "0"
                 //PRLH1 = high >> 8 ;  //  старший байт для "1"
                   // Для того, чтобы все записывалось одной командой.
                 *(w*)&PRLL1 = (low >> 8) | (high & 0xff00) ;

               break;
              //------------
        case 1 :
                 PRLL2 = low  ;
                 PRLH2 = high ;
                 *(w*)&PRLL3 = (low >> 8) | (high & 0xff00) ;
               break;
              //------------
      }

  return ;
}


//
//     Запуск PPG с заданием его номера.
//
void  PPG_start( byte n )
{
      switch ( n )
      {
        case 0 :
                 PPGC0 |= 0x20;     //  нулеве каналы не подключены к выходам.
                 //PPGC1 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
        case 1 :
                 PPGC2 |= 0x20;
                 //PPGC3 |= 0x20;      // подключаем PPG к выходу.
               break;
              //------------
      }

  return ;
}


//
//     Остановка PPG с заданием его номера и исходного выходного
//   уровня.
//
void  PPG_stop( byte n, byte lev )
{
      switch ( n )
      {
        case 0 :
                 PDR1_P14 = lev ;  // задаем предварительно требуемый уровень выхода.
                 PPGC0 &= ~0x20;
                 //PPGC1 &= ~0x20;   // отключаем PPG от выхода.
               break;
              //------------
        case 1 :
                 PDR1_P16 = lev ;  // задаем предварительно требуемый уровень выхода.
                 PPGC2 &= ~0x20;
                 //PPGC3 &= ~0x20;   // отключаем PPG от выхода.
               break;
              //------------
      }

  return ;
}

