

//  Программа инициализации послед.порта, его прерывания и буферов для прерывания.

void  Init_CPU_Ports ( void )
{
  __set_il(7);       // маска запросов прерываний - все разрешены

    //   В "DDRx": 1 - выход, 0 - вход.
    //   В "PDRx": начальное значение выходного сигнала - 1 или 0.

  DDR0 = 0xFC; //  P00,P01 - входы для програмирования
               //  Р02- Р07 - не используются
  PDR0 = 0xff;

#ifndef _RT_dev

  DDR1 = 0xFF; //  P10-P13 - транизисторные выходы
               //  Р14, Р16 - PPG - остальные не используются
  PDR1 = 0x00;

#else

  DDR1 = 0xFE; //  P10 - вход синхронизации
               //  P11-P13 - дискретные выходы
               //  Р14, Р16 - PPG - остальные не используются
  PDR1 = 0x00;


#endif

  DDR2 =0x87 ; //Р20 - Р22  - дискретные выходы на светодиоды
               //Р23- Р26  - дискретные входы
               //Р27  -  не используются
  PDR2 = 0x07;

  DDR3 =0xFB ; // Р30 - SOT
               // Р31 - SCK
               // P32 - SIN
               // P33-P35 - CS для SPI
  PDR3 =0xC0;//i2c :p36-SCL, p37-SDA

  DDR4 = 0x0e ;  // enable SOT1, TXC (00001110)
  PDR4_P41 = 1;  // выход Imax

  DDR5 = 0x80 ;  // АЦП входы - для начала, как дискретные входы, P57 - нe используется

  DDR6 =0x0B ;  // P60 - не используется
                // Р61 - Usel
                // Р62 - Автостарт
                // Р63 - выход Imin

  return   ;
}
/*ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД-  */

